{"posts":[{"title":"2024：一周速览，1","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，1 本周发布回顾 国家主席习近平发表二〇二四年新年贺词（全文） 图灵奖：尤里斯·哈特马尼斯（1993） 尬聊：足协新政炸裂登场 AI栏目回归 荐歌：Layla蕾拉（张杰） 精彩开年大片：《持续发力纵深推进》第一集 热点事件 选自搜狐。 6国超11万人次免签入境中国 新年首战国足1-2不敌中国香港 日本保安厅飞机与客机相撞已致5死 主持人称日本地震是报应 被停职 反腐大片 杜兆才、陈戌源、李铁出镜忏悔 贪官敛财细节披露:22个纸箱装满钱 阿根廷总统遭重挫 激进改革被叫停 李在明婉拒文在寅探望提议 俄乌冲突第3年 俄允许”外籍兵”入籍 美停飞170余架波音737飞机 陕西通报5人烧炉取暖中毒已致4死 日本地震导致部分海域变陆地 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/c725156c/"},{"title":"2024：一周速览，11","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，11 本周发布回顾 观影：聊聊最近看的几部电影 图灵奖：弗雷德·布鲁克斯（1999） 冲浪：有趣的照片（五） 温故：年终奖怎么扣个税？ 温故：个人所得税怎么算的？ 荐歌：明天你依旧在我身旁（声音玩具） 看球去了：2024足协三级联赛赛程 热点事件 选自搜狐。 拜登锁定美民主党总统候选人提名 特朗普锁定共和党总统候选人提名 钟薛高身陷泥潭 有员工欠薪数月 泰前总理他信获释后首次公开露面 王毅将正式访问新西兰澳大利亚 4人参选 俄罗斯明日开启总统选举 日本核污染水第四轮排海结束 国足确定赴新加坡26人球员名单 直击雅江山火:城边4公里可见明火 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/c71fe7d1/"},{"title":"2024：一周速览，12","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，12 本周发布回顾 科技：实力硬刚OpenAI，马斯克将Grok-1开源 尴尬，开个天窗 图说：珍贵的照片（六） 看球：世预赛中国憾平新加坡 荐歌：唐人街（赵英俊） 不用发信息，直接看有没有被微信好友拉黑 热点事件 选自搜狐。 莫斯科音乐厅遭恐怖袭击 50城连降3月 全国房价比峰顶下降23% 巴基斯坦空袭阿富汗致8人死亡 香港全票通过《维护国家安全条例》 东航132人遇难事故调查进展公布 “补血”14亿 万科债务困局打开缺口 普京正式赢得俄总统选举 “姐弟坠楼案”孩子母亲患甲状腺癌 雅江山火初查系施工动火作业引发 瑙鲁总统阿迪昂将访华 克宫:在乌特别军事行动已转变为战争 凯特王妃露面 称患癌正在治疗中 农夫山泉否认向哈佛、日本地震捐款 欧盟四国计划承认巴勒斯坦国 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/5e16b66b/"},{"title":"2024：一周速览，13","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，13 本周发布回顾 体育：韩旭李梦放弃WNBA，李月汝选择再搏一次 看球：刚刚，国足4:1新加坡 晚安，夜行人 刚刚，小米汽车开启预定 荐歌：深夜书店（许嵩、洛天依） 看球：韦世豪今日特辑 热点事件 选自搜狐。 翟欣欣已认罪认罚或将获刑10年以上 足协原主席陈戌源一审被判无期徒刑 成都通报试卷现美化侵华日军文章 深圳楼市重磅!”90/70政策”废止 再裁7万公务员 阿根廷改革升级 马航MH370将重启搜索 美即将以隐私安全为由对TikTok下手 万科高管自愿降薪至每月税前1万 阿富汗将恢复对通奸妇女石刑鞭刑 荷兰政府砸25亿欧元挽留阿斯麦 万达获得600亿投资 中东资本入局 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/291186fd/"},{"title":"2024：一周速览，15","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，15 本周发布回顾 充数：6年前的一个瞬间 图灵奖：奥利-约翰·达尔（2001） 看球：成都蓉城vs浙江 看球：女甲联赛第一阶段赛程 荐歌：危险派对（王以太） 晚安，看球人 热点事件 选自搜狐。 农发行要求加强对“一把手”监督 赵乐际将对朝鲜进行正式友好访问 “虐猫考生”未被兰大录取 律师解读 此前未被南大录取 著名物理学家彼得·希格斯去世 拒绝割地求和 泽连斯基称要反攻 韩国总理等多名政府高官同时请辞 拜登承诺将用核武器保护日本 中国资本市场迎来第三个”国九条” 德国总理朔尔茨抵达重庆 2024年北京半程马拉松何杰、刘敏夺冠 北京半马冠军被质疑”保送”? 河南原则上不再保留科级事业单位 千万粉丝网红“猫一杯”因造谣被封 法国“丢作业本”事件 悉尼商场发生无差别行凶已致7死 重庆调查“市民换表后燃气费翻倍” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/c07223c8/"},{"title":"2024：一周速览，16","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，16 本周发布回顾 时事：惊了，“半马”比赛造假！ 图灵奖：克利斯登·奈加特（2001） 数据可视化：平行坐标图（parallel coordinates plot） 沉浸式体验女篮决赛 热点事件 选自搜狐。 知情人：刘强东即将开启直播 中国一季度GDP同比增长5.3% 习近平会见德国总理朔尔茨 菲总统：新增美军基地是为对付中国 市值狂泻2200亿 马斯克如何应对 人社部:养老保险断缴参保记录不清零 美国一票否决巴勒斯坦入联申请 男子开宝马撞人致6死 被执行死刑 北半马“假赛”:取消冠军等4人成绩 中国人民解放军信息支援部队成立 埃尔多安会见哈马斯领导人商讨停火 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/597b7272/"},{"title":"2024：一周速览，17","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，17 本周发布回顾 刚刚：四川女篮战胜内蒙古，成功卫冕WCBA总冠军 图灵奖：伦纳德·阿德曼（2002） 图说：强迫症良药（七） 数据可视化：开篇（1） 荐歌：勇气（夏日入侵企画、张震岳） 偷闲一日，骑绿道逛公园 热点事件 选自搜狐。 神十七、神十八乘组完成太空交接 重庆燃气:对有问题收费已全面清退 强龙卷过后 广州多个村庄被掀翻 福建舰快海试了？专家：为期不远 美宣布为乌购买价值60亿美元武器 中国国航宣布购买100架C919飞机 中美达成五点共识 字节跳动:没有任何出售TikTok的计划 凯特王妃被英国王室授予名誉勋位 英国首相将中国列为威权主义国家 假唱调查仍没结果 五月天官宣演唱会 “点读机女孩”高君雨全网账号被禁 山西吕梁42名公职人员因火灾被问责 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/2e7c42e4/"},{"title":"2024：一周速览，2","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本周发布回顾 尬聊：坐标成都，零上10度 央视反腐大片：李铁片段 令人惊叹的照片（三） 尬聊：Apple Vision Pro 飞机上看大好河山 看球去了：22:30，中国男足亚洲杯首战 热点事件 选自搜狐。 C919开始执飞第二条定期商业航线 李铁一路砸钱当上国足主帅 NASA宣布载人登月计划推迟一年 比特币现货ETF获批 可像股票一样交易 张继科风波后首次公开现身 山西重大刑案嫌犯李三喜已被抓获 流浪纽约复旦博士：正在当地治疗 国足亚洲杯首战0-0战平塔吉克斯坦 国台办发言人评论台湾地区选举结果 “尔滨效应”刺激多地”卷”文旅 河南平顶山煤矿事故已确定13人遇难 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/5e2c44d6/"},{"title":"2024：一周速览，3","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，3 本周发布回顾 央视反腐大片：陈戌源片段 图灵奖：理查德·斯特恩斯（1993） 中国男足力保城门不失，武磊再现名场面 尬聊一下：生意是真难做啊 荐歌：宿敌（许嵩） 看球去了：东亚足球的大旗还得是中国扛 热点事件 选自搜狐。 河南平顶山煤矿事故已确定13人遇难 平顶山煤矿事故涉事书记、矿长被免职 甘肃举债搞有轨电车 亏空超3000万 彻底翻脸？朝鲜废除和平统一机构 金正恩:应修宪将韩国列为头号敌国 朝鲜：普京表示愿意尽快访朝 任泽平炮轰拼多多:纵容小偷、假货泛滥 特朗普赢得美国大选首场共和党初选 马宁给韩国队5张黄牌 韩媒质疑 外交部：建议菲律宾总统多读读书 2023年中国GDP超126万亿 增长5.2% 2023年全国城镇调查失业率5.2% 三大指数跌超2% 沪指创三年半新低 体彩罕见开出”55555” 奖池被清空 朝鲜进行了水下核武器系统试验 胡塞武装:中俄船只可安全通过红海 日本小型探测器实现登月但出故障 江苏武进一企业爆炸致8死8伤 银川烧烤店爆炸致31死 细节首披露 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/292b7440/"},{"title":"2024：一周速览，4","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，4 本周发布回顾 看球去了：继大连后，深圳队解散 图灵奖：拉吉·瑞迪（1994），生活大爆炸的Raj 看球去了：终于，我的主队四川九牛又没了 恭喜各位，新加坡免签了！ 荐歌：男孩别哭（海龟先生） 澳网亚军！恭喜21岁郑钦文 热点事件 选自搜狐。 中国选手郑钦文获得澳网女单亚军 印度政府决定在印缅边境修筑围墙 女子举报退休局长后因1805元被追逃 沪指再度跌破2800点 泽连斯基再邀特朗普访问乌克兰 中国“完全停止”对美出口镓和锗 留美博士枪杀华裔导师详情披露 “唐山烧烤店打人案”保护伞获刑12年 中国第一个GDP13万亿大省诞生 国足彻底出局！无缘亚洲杯16强 中国和瑙鲁恢复外交关系 图瓦卢大选后或与台当局“断交” 华农教授造假细节:养80头猪花18亿 体育总局原副局长杜兆才被提起公诉 蔡磊夫妇捐1亿元用于攻克渐冻症 谷歌工程师杀妻案 嫌疑人仍在医院 中国与泰国签署互免签证协定 霍启刚、霍启智均已履职政协委员 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/b74fe1e3/"},{"title":"2024：一周速览，10","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，10 本周发布回顾 速查：什么是全国两会？ 图灵奖：詹姆斯·尼古拉·格雷（1998） 冲浪：为什么宇航服有白和橙两种颜色？ 尬聊：严峻的就业形势 纪念：鸟山明《龙珠》主题曲 2024中国足球协会甲级联赛对阵日程表 热点事件 选自搜狐。 伊万科维奇正式开展国家队执教工作 2024年GDP增长预期目标为5%左右 2024年国防预算增长7.2% 遇难渔民家属：台当局无一句道歉 黑利正式宣布退出美国总统竞选 中立政策结束 瑞典正式加入北约 加政府赔偿在华被捕间谍700万加元 张志磊无缘卫冕重量级拳王金腰带 拜登支持强制出售TikTok ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/b018d747/"},{"title":"2024：一周速览，5","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，5 本周发布回顾 尬聊：天下苦移动流量久已 图灵奖：爱德华·费根鲍姆（1994） 罪犯吴谢宇被执行死刑 罪犯张波、叶诚尘被执行死刑 尬聊：贝壳找房开放历史成交数据查询 荐歌：哈尼宝贝（南征北战NZBZ） 尬聊：年味渐浓，都快赶路了吧 热点事件 选自搜狐。 足协原副主席于洪臣被控受贿2254万 普京收入公开:6年约535万元人民币 31省份敲定2024年GDP目标 农村办席被工作人员往食物中撒盐 财政部:养老金按时足额发放有保证 欧盟谈妥了：额外援乌500亿 美国表态：寻求建立巴勒斯坦国 茅台原董事长高卫东贪1.1亿获无期 沪指跌破2700点 超5100股下跌 马英九：支持蔡英文登太平岛 禁网约车后,浦东机场仍有一平台能订车 为报复基地遭袭 美国空袭叙伊两国 中植集团破产清算进展 美众议院宣布176亿美元援以法案 脱口秀演员杨波发文称轻生 现已获救 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/c048d175/"},{"title":"2024：一周速览，9","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，9 本周发布回顾 2023中国金球奖各奖项得主揭晓 图灵奖：道格拉斯·恩格尔巴特（1997） 冲浪：那些鲜为人知的照片（四） 中超2024明日开启，去最近的球场感受一下中国足球吧！ 荐歌：没那种命（陈小春） 看球去了：成都蓉城首轮战青岛海牛 热点事件 选自搜狐。 人民法院案例库上线 裁判文书网不关闭 秦刚辞去全国人大代表职务 “重庆姐弟坠楼案”生母:将直播带货 2023年度个税汇算今起开始 蔡英文办公室一卫兵中枪 疑为自戕 东航第五架C919大飞机交付入列 官方通报村干部坐拥60亩地：已批捕 马来西亚：尽快重启马航MH370搜索 马克龙与朔尔茨矛盾公开化 菲驻美大使:在南海面临中国”侵略” 美国首次向加沙空投食品和援助物资 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/c9fe9d5e/"},{"title":"AI：图神经网络（GNN）系列文章预告","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 最近切换工作和业务中，有很多东西需要复习和学习，比较忙乱。这里说明一下周四的 AI 栏目有些拖更的地方： MLIR系列文章拖更 加紧抽空调代码中，预计还剩最后 2 期左右就可以更完 会在结束的时候重新整理整个系列文章，让读者无痛上手 MLIR 有读者反馈有的代码可能跑不通了 准备看了；主要是换了新公司，原来的电脑上交了，新环境的 LLVM 这些东西还没就绪 非常抱歉！ 好消息是 research 的工作占比又上来了。新公司对 AI 落地表示出了比较强烈的期望，所以会有更多的时间去做一些一直想做的方向。其中就包括我很看好的图神经网络（GNN）这一块儿。 所以应该在下下次的周四开始，“科文路”将会以手把手实践的方式、开启很有用但又有一点儿复杂的新领域的学习——GNN。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/12aa6687/"},{"title":"AI基础（1）：Gradient,-Jacobian-matrix-and-Hessian-matrix","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 Gradient, Jacobian matrix and Hessian matrix这两周，扮演了几场面试官。最大的感触是，应届生在基础数学知识的储备上存在很大的问题。所以我决定把我认为重要的 AI 基础知识拿出来过一下。 用英文写的（水平一般），帮助各位了解下术语。 1 GradientThe gradient of $f$ is defined as the unique vector field whose dot product with any unit vector $\\mathbf{v}$at each point $x$ is the directional derivative of f$f$ along $\\mathbf{v}$. That is, $$\\big (\\nabla f(x){\\big )}\\cdot \\mathbf {v} =D_{\\mathbf {v} }f(x)$$ e.g. in coordinate system, 沿着 $i$ 方向的导数，就是 $i$ 轴方向的分量 $$\\nabla f = \\frac { \\partial f } { \\partial x _ { 1 } } e _ { 1 } + \\cdots + \\frac { \\partial f } { \\partial x _ { n } } e _ { n }$$ Attention: the relationship to derivation 2 Jacobian matrix 雅可比矩阵的重要性在于它体现了一个可微方程与给出点的最优线性逼近。 因此，雅可比矩阵类似于多元函数的导数。 The Jacobian of a vector-valued function in several variables generalizes the gradient of a scalar-valued function in several variables, which in turn generalizes the derivative of a scalar-valued function of a single variable. If $f$ is differentiable at a point $p$ in $\\mathbb{R}^n$, then its differential is represented by $J_f(p)$. In this case, the linear transformation represented by $J_f(p)$ is the best linear approximation of f near the point p, in the sense that $$f ( x ) - f ( p ) = J _ { f } ( p ) ( x - p ) + o ( | x - p | ) \\quad ( \\text { as } x \\rightarrow p )$$ This approximation specializes to the approximation of a scalar function of a single variable by its Taylor polynomial of degree one, namely $$f(x)-f(p)=f’(p)(x-p)+o(x-p)\\quad ({\\text{as }}x\\to p)$$ The Jacobian matrix represents the differential of $f$ at every point where $f$ is differentiable. $$\\mathbf {J} ={\\begin{bmatrix}{\\dfrac {\\partial \\mathbf {f} }{\\partial x_{1}}}&amp;\\cdots &amp;{\\dfrac {\\partial \\mathbf {f} }{\\partial x_{n}}}\\end{bmatrix}}={\\begin{bmatrix}{\\dfrac {\\partial f_{1}}{\\partial x_{1}}}&amp;\\cdots&amp;{\\dfrac {\\partial f_{1}}{\\partial x_{n}}}\\\\vdots &amp;\\ddots &amp;\\vdots \\ {\\dfrac {\\partial f_{m}}{\\partial x_{1}}}&amp;\\cdots &amp;{\\dfrac {\\partial f_{m}}{\\partial x_{n}}}\\end{bmatrix}}$$ 3 Hessian$$\\mathbf {H}(f(\\mathbf {x}))= \\mathbf {J}(\\nabla f(\\mathbf {x}))^T$$ $$\\mathbf {H} ={\\begin{bmatrix}{\\dfrac {\\partial ^{2}f}{\\partial x_{1}^{2}}}&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{1},\\partial x_{2}}}&amp;\\cdots &amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{1},\\partial x_{n}}}\\{\\dfrac {\\partial ^{2}f}{\\partial x_{2},\\partial x_{1}}}&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{2}^{2}}}&amp;\\cdots&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{2},\\partial x_{n}}}\\\\vdots &amp;\\vdots &amp;\\ddots &amp;\\vdots \\{\\dfrac {\\partial ^{2}f}{\\partial x_{n},\\partial x_{1}}}&amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{n},\\partial x_{2}}}&amp;\\cdots &amp;{\\dfrac {\\partial ^{2}f}{\\partial x_{n}^{2}}}\\end{bmatrix}}$$ 即在每一个变化方向（$\\nabla$）上做线性逼近（Jacobian），这可能可以体现变化程度？ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 赞赏请前往公众号菜单栏~~ 至少点个赞再走吧~","link":"/kewenlu/posts/1a64cb5/"},{"title":"图灵奖：丹尼斯·里奇（1983）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 21 期。图灵奖：丹尼斯·里奇（1983） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Dennis Ritchie，翻译基于 谷歌翻译. 所有程序员都知道的 K&amp;R 丹尼斯·里奇（Dennis MacAlistair Ritchie，1941 年 9 月 9 日 – 2011 年 10 月 12 日）是一位美国计算机科学家。 他因创建 C 编程语言（名著《K&amp;R》的R）而闻名，并与同事 Ken Thompson 一起创建了 Unix 操作系统和 B 编程语言。 他于 1983 年获得图灵奖。 其图灵奖颁奖词为“与 Ken Thompson 一起开发了通用操作系统理论并专门用于 UNIX 操作系统的实现。”。（With Ken Thompson, for their development of generic operating systems theory and specifically for the implementation of the UNIX operating system.） 生平丹尼斯·里奇出生于纽约州 Bronxville。 他的父亲是阿利斯泰尔·E·里奇 (Alistair E. Ritchie)，是贝尔实验室的长期科学家，也是开关电路理论书籍《开关电路设计》的合著者。 丹尼斯小时候随家人搬到了新泽西州的 Summit，并在那里从 Summit 高中毕业。后来从哈佛大学毕业，获得物理学和应用数学学位。 1967年，Ritchie开始在贝尔实验室计算科学研究中心工作，1968年，他在 Patrick C. Fischer 的指导下在哈佛大学答辩了关于“计算复杂性和程序结构”（Computational Complexity and Program Structure）的博士论文。 然而，里奇从未正式获得博士学位，因为他没有向哈佛大学图书馆提交论文的装订副本，而这是该学位的要求。 UNIX20 世纪 60 年代，Ritchie 和 Ken Thompson 在贝尔实验室研究 Multics 操作系统。 随后，汤普森找到了一台旧的 PDP-7 机器，并在里奇和其他人的帮助下从头开始开发了自己的应用程序和操作系统。 1970 年，Brian Kernighan 建议使用“Unix”这个名称，这是“Multics”这个名称的双关语。 C语言为了用系统级编程语言来补充汇编语言，Thompson 创建了 B 语言。后来，B 被 Ritchie 创建的 C 所取代，Ritchie 多年来继续为 Unix 和 C 的发展做出贡献。 Ritchie 还参与了 Plan 9 和 Inferno 操作系统以及编程语言 Limbo 的开发。 作为 20 世纪 90 年代中期 AT&amp;T 重组的一部分，Ritchie 被调到朗讯科技公司，并于 2007 年以系统软件研究部主管的身份退休。 贡献 ALTRAN B BCPL C Multics Unix ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/d8f173c6/"},{"title":"2024：一周速览，8","text":"一周速览为每周日晚固定栏目，将会回顾本周的热点事件。 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。2024：一周速览，8 本周发布回顾 谢赛宁否认Sora跟他有关，回复Sora为何未在中国出现时反问“我们准备好了吗？” 图灵奖：阿米尔·伯努利（1996） 逛Quora：一些创意解决方案 英特尔18A重回工艺领先地位？台积电：没可能 荐歌：那女孩对我说（黄义达） 带国足进美加墨世界杯？伊万科维奇好像不是在开玩笑 热点事件 选自搜狐。 娃哈哈集团创始人宗庆后逝世 疑因山火影响 重庆西站多趟列车晚点 宾利事件劝架者获授”治安荣誉奖章” 以将派代表团赴卡塔尔继续谈停火 国乒男队3比0击败法国 实现11连冠 福建海警在金门附近海域开展执法巡查 73比76!中国男篮88年来首负日本 民政部通报2.2亿元彩票大奖情况 C919再签新订单 共40架 时隔30年 英国外长再登马岛 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/bef9adc8/"},{"title":"图灵奖：伊凡·苏泽兰（1988）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 28 期。图灵奖：伊凡·苏泽兰（1988） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Ivan Sutherland，翻译基于 谷歌翻译. 计算机图形学之父 伊凡·爱德华·苏泽兰（Ivan Edward Sutherland，1938 年 5 月 16 日出生），美国计算机科学家和互联网先驱，美国国家工程院和美国国家科学院院士，并获得过许多其他重大奖项。 他早期在计算机图形学方面的工作以及 20 世纪 70 年代在犹他大学与 David C. Evans 一起教授该学科的工作使其被广泛认为是计算机图形学的先驱。苏泽兰、埃文斯和他们那个时代的学生奠定了现代计算机图形学的几个基础。 1988 年，他因发明画板（Sketchpad）而获得图灵奖，画板是个人计算机中普遍存在的图形用户界面的早期前身。 他于 1988 年获得图灵奖。 其图灵奖颁奖词为“表彰他对计算机图形学的开创性和富有远见的贡献，从画板开始、一直到后来”。（For his pioneering and visionary contributions to computer graphics, starting with Sketchpad, and continuing after.） 生平苏泽兰 1938 年 5 月 16 日出生于美国内布拉斯加州黑斯廷斯，他的血统来自苏格兰和新西兰。 他于 1959 年在卡内基理工学院获得电气工程学士学位，1960 年在加州理工学院获得硕士学位，1963 年获得麻省理工学院电气工程博士学位。 苏泽兰于 1962 年在麻省理工学院发明了画板（Sketchpad），并基于此撰写了博士论文。他的论文导师是克劳德·香农。是的，就那个信息论之父。他的论文委员会成员包括马文·明斯基（Marvin Minsky，AI领域大佬，1969年图灵奖）和史蒂文·库恩斯。 1963 年至 1965 年，获得博士学位后，他在美国陆军服役。 1965 年至 1968 年，苏泽兰担任哈佛大学电气工程系副教授。 1968年至1974年，苏泽兰担任犹他大学教授。其中，1968 年，他与朋友兼同事 David C. Evans 共同创立了 Evans &amp; Sutherland。Evans &amp; Sutherland 的前雇员包括 Adobe (John Warnock) 和 Silicon Graphics (Jim Clark) 未来的创始人。 1974 年至 1978 年，他担任加州理工学院计算机科学系 Fletcher Jones 教授，并担任该学院计算机科学系的创始系主任。 SketchpadSketchpad 是一个创新程序，影响了与计算机交互的其他形式。 画板可以接受线段和圆弧之间的约束和指定关系，包括圆弧的直径。它可以绘制水平线和垂直线，并将它们组合成图形和形状。可以复制、移动、旋转图形或调整图形大小，同时保留其基本属性。画板还拥有第一个窗口绘制程序和剪切算法，允许缩放。 苏泽兰的名言 “It’s not an idea until you write it down.” 想法在写下来之前，不是一个想法 “I just need to figure out how things work.” 我只需要弄清楚事情是如何运作的 “It’s very satisfying to take a problem we thought difficult and find a simple solution. The best solutions are always simple.” 解决我们认为困难的问题并找到一个简单的解决方案是非常令人感到满足的。最好的解决方案总是简单的。 “Never underestimate the power of the professorial windbag;” 不要低估教授们空谈的威力 “Interesting colleagues are essential.” 有趣的同事是必不可少的 “If it isn’t fun, you’re doing the wrong technology.” 如果它不有趣，那么你就使用了错误的技术 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/51db16f7/"},{"title":"图灵奖：伦纳德·阿德曼（2002）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 43 期。图灵奖：伦纳德·阿德曼（2002） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Leonard Adleman，翻译基于 谷歌翻译. DNA 计算之父 伦纳德·阿德曼（Leonard Adleman，1945 年 12 月 31 日出生），美国计算机科学家。 他是 RSA 加密算法的创始人之一，他还因创建 “DNA 计算”而闻名。 他于 2002 年获得图灵奖。 其图灵奖颁奖词为“与 Ronald Rivest 和 Adi Shamir 一起，表彰他们为使公钥密码学在实践中发挥作用做出的独创贡献。”。（Together with Ronald Rivest and Adi Shamir, for their ingenious contribution to making public-key cryptography useful in practice. ） 生平阿德曼出生于加利福尼亚州的一个犹太家庭。 他的家人最初从现代白俄罗斯的明斯克地区移民到美国。 他在旧金山长大，就读于加州大学伯克利分校，于 1968 年获得数学学士学位，并于 1976 年获得电气工程与计算机科学（EECS）博士学位。 1976年获得EECS学位。 1996年，他因对计算和密码学理论的贡献而成为美国国家工程院院士。他同时也是美国国家科学院院士。 阿德曼也是一名业余拳击手，曾与詹姆斯·托尼（职业拳击手，多次获得世界冠军）交手过。 DNA 计算1994 年，他的论文《组合问题解的分子计算》（Molecular Computation of Solutions To Combinatorial Problems）描述了 使用 DNA 作为计算系统的实验。 其中，他解决了哈密顿图（Hamiltonian Graph）问题的七节点实例，这是一个类似于旅行商问题的 NP 完全问题。 虽然七节点实例的解决方案很简单，但本文是第一个成功使用 DNA 计算算法的已知实例。 DNA 计算已被证明有潜力作为解决其他几个大规模组合搜索问题的手段。 阿德曼被广泛称为 DNA 计算之父。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/1acde365/"},{"title":"GNN：抽象数据类型，图（1）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 图神经网络（GNN）是用于处理可以表示为图的数据的一类人工神经网络。本文为图神经网络系列文章第 1 期，介绍作为抽象数据类型的图，怎么去“抽象”。 相信学过数据结构或者离散数学相关课程的朋友不会陌生“图”这个概念，今天一起来复习一下。 为了消除歧义，最好熟练记下英文术语。 图，基本概念 在计算机科学中，图是一种抽象数据类型（ADT，abstract data type），旨在实现数学里的图论领域中无向图和有向图的概念。 上面就是一个“抽象”的图，其中， 蓝色圆圈为 vertex（node，节点/顶点），简记为 $V$ 这里注意 vertex 的复数形式是 vertices 黑色连线为 edge（link，边） 如果带箭头，则为 directed（有向），如图，简记为 $E$ 不带箭头，则为 undirected（无向） 整幅图，简记为 $U$ 为 GNN 引入的概念，表示这幅图的整体信息 也就是说，图数据结构就是一组有限的顶点和边的集合。那 GNN 中的研究对象，一个图，就可以记作 $G(V,E,U)$。 怎么理解“抽象”这里注意，既然是抽象数据类型，那么图的组成部分携带的信息应该也是抽象出来的。也就是说，要从任务出发，用 $(V,E,U)$ 三个变量/集合，携带所有需要的信息。 简单举个建模的例子——用上面那张图来构建一次旅行规划的基础。 1. 任务我现在人在成都，正在考虑一个一日游，有两个方案可选， 去重庆玩一天返回 上午去宜宾，然后下午经重庆返回 2. 根据地图构建图打开地图，根据列车信息，构建了这样一个图， 三个节点分别表示地点 宜宾/重庆/成都 三条有向边，带信息 宜宾-&gt;重庆，车程 1 h 重庆-&gt;成都，车程 1 h 成都-&gt;重庆，车程 1 h 成都-&gt;宜宾，车程 1 h 整个图表示一个“一日游方案” 抽象成 $G(V,E,U)$，其中， $V={宜宾,重庆,成都}$ $E={E_1,E_2,E_3,E_4}$ $E_1 = 宜宾重庆:1$ … $U=”一日游方案”$ 3. 哪里抽象了?由于我的目的是根据在途时长信息制定行程，于是图上只有我想去的城市以及行程耗时。 这个地方有什么风景、中间会经过哪些站、谁将和我一起去、我在哪一天去等等这些与目的无关的信息通通都被去掉了。 最终剩下了一个只包含必要信息的数据结构，这即是“抽象”。 当然，这个“必要信息”就是“抽象”的过程。 4. 收益看这张图，平平无奇，却抽象出了我两个方案的所有信息以及其他一些可以直接推导的信息（由于这是我拍脑袋想出来的例子,有些信息有些无厘头）， 方案 1 总耗时 2h 方案 2 总耗时 3h 去了宜宾就得去重庆，因为没有回来的车 去了重庆就没有回宜宾的车 5. permutation invariant最重要的是，假定这张图已包含了所有的与旅程规划相关的信息，那么对这个图翻转/旋转/拉伸等等，都不会改变这些所包含的信息以及推出的信息。 抽象点讲就是，只要 $G(V,E,U)$ 的内容没有变，那他包含的那些信息不会因为图被画出来的样子改变。 这些信息通过“图”体现出一个非常重要的特性，permutation invariant，也叫置换不变性/排列不变性。这就是后面 GNN 的应用里，需要重点寻找的特征。 总结本期作为 GNN 系列文章的开篇，介绍了图抽象数据类型的概念，并且使用一个简单的例子说明了如何去抽象一个现实问题。 下一期将介绍如何使用代码表示这些信息。 参考 https://en.wikipedia.org/wiki/Graph_(abstract_data_type) ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/797d9d82/"},{"title":"图灵奖：克利斯登·奈加特（2001）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 42 期。图灵奖：克利斯登·奈加特（2001） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Kristen Nygaard，翻译基于 谷歌翻译. 面向对象编程之父之一 克利斯登·奈加特（Kristen Nygaard，1926 年 8 月 27 日－2002 年 8 月 10 日），挪威计算机科学家、编程语言先驱和政治家。 与奥利-约翰·达尔一起被认为是 Simula 和面向对象编程之父之一。 他于 2001 年获得图灵奖。 其图灵奖颁奖词为“与 Ole-Johan Dahl 合作，通过设计编程语言 Simula I 和 Simula 67，诞生面向对象编程的基本思想”。（With Ole-Johan Dahl, for ideas fundamental to the emergence of object oriented programming, through their design of the programming languages Simula I and Simula 67. ） 生平奈加特出生于奥斯陆，1956 年在奥斯陆大学获得数学硕士学位。他关于抽象概率论的论文题为“蒙特卡洛方法的理论方面”（”Theoretical Aspects of Monte Carlo methods”）。 1948 年至 1960 年，奈加特在挪威国防研究机构全职工作，从事业务为计算和编程（1948-1954 年）以及运筹学（1952-1960 年）。 1957 年至 1960 年间，他担任挪威国防机构第一批运筹学小组的负责人。 他是挪威运筹学会的联合创始人和第一任主席（1959-1964）。 1960年，他受聘于挪威计算中心（NCC），负责将NCC建设成20世纪60年代的研究所，并于1962年成为该中心的研究主任。 面向对象 OO20 世纪 60 年代，作为 Simula I 和 Simula 67 仿真编程语言的一部分，达尔与 Kristen Nygaard 一起在挪威计算中心 (Norsk Regnesentral (NR)) 提出了面向对象 (OO) 编程的初步想法。这最初是 ALGOL 60 的扩展变体和超集。 达尔 和 Nygaard 是第一个提出类、子类（允许隐式信息隐藏）、继承、动态对象创建等概念的人，这些都是面向对象（OO）范式的重要概念。 对象是软件系统中的独立组件（具有数据结构和关联的过程或方法）。这些结合起来就形成了一个完整的系统。 面向对象的方法现在在现代软件开发中很普遍，包括广泛使用的命令式编程语言，例如 C++ 和 Java。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/435cf858/"},{"title":"图灵奖：史蒂芬·库克（1982）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 20 期。图灵奖：史蒂芬·库克（1982） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Stephen Cook，翻译基于 谷歌翻译. P=NP？ 史蒂芬·库克（生于 1939 年 12 月 14 日）是一位美籍加拿大计算机科学家和数学家，在复杂性理论（complexity theory）和证明复杂性（proof complexity）领域做出了重大贡献。他现在是多伦多大学计算机科学系和数学系的大学教授。 他于 1982 年获得图灵奖。 其图灵奖颁奖词为“表彰他以重大而深刻的方式增进了我们对计算复杂性的理解。他在 1971 年 ACM SIGACT 计算理论研讨会上发表的开创性论文“定理证明过程的复杂性”为 NP 完备性理论奠定了基础。随后对 NP 完全类问题的边界和性质的探索是过去十年中计算机科学中最活跃和最重要的研究活动之一”。（For his advancement of our understanding of the complexity of computation in a significant and profound way. His seminal paper, “The Complexity of Theorem Proving Procedures,” presented at the 1971 ACM SIGACT Symposium on the Theory of Computing, laid the foundations for the theory of NP-Completeness. The ensuing exploration of the boundaries and nature of NP-complete class of problems has been one of the most active and important research activities in computer science for the last decade.） 生平库克于 1961 年在密歇根大学获得学士学位，并分别于 1962 年和 1966 年在哈佛大学数学系获得硕士和博士学位。 他于 1966 年加入加州大学伯克利分校数学系，担任助理教授，直到 1970 年他拒绝了续聘。 在庆祝伯克利电气工程和计算机科学系成立 30 周年的演讲中，图灵奖得主、伯克利教授理查德·卡普 (Richard Karp) 表示：“我们无法说服数学系给予他终身教职，这是我们永远的耻辱。 ” 库克于 1970 年加入多伦多大学计算机科学和数学系，担任副教授，并于 1975 年晋升为教授，于 1985 年晋升为杰出教授。 P/NP 问题在攻读博士学位期间，库克研究了函数的复杂性，尤其是乘法。 在他 1971 年的开创性论文“定理证明程序的复杂性”（The Complexity of Theorem Proving Procedures）中，库克形式化了多项式时间归约（也称为库克归约）和 NP 完备性的概念，并通过证明布尔可满足性问题（通常称为 SAT）是 NP 完全的来证明了 NP 完全问题的存在性。该定理同时由苏联的列昂尼德·莱文（Leonid Levin）独立证明，因此被命名为库克-莱文定理。 这篇论文还阐述了计算机科学中最著名的问题，即 P/NP 问题（P versus NP problem）。通俗地说，P/NP 问题询问每个优化问题的答案是否可以通过有效的算法验证正确性/最优性。鉴于日常生活中存在大量此类优化问题，对P/NP问题的积极回答可能会产生深远的实践、哲学结论。 库克猜想，存在优化问题（具有易于检查的解决方案）无法通过有效的算法解决，即 P 不等于 NP。 这一猜想引发了计算复杂性理论的大量研究，极大地提高了我们对计算问题的固有难度以及可以有效计算的内容的理解。然而，这个猜想仍然存在，并且是七个著名的千禧年问题之一。 贡献 NP-completeness Propositional proof complexity complexity theory ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/230bdb3b/"},{"title":"图灵奖：唐纳德·尔文·克努斯（高德纳，1974）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 10 期。 本文来自 wiki: Donald_Knuth，翻译基于 腾讯交互翻译. 如果你没听过 TAOCP，那么说明你的计算机知识水平还有很大的进步空间。 唐纳德·尔文·克努斯（中文名“高德纳”，Donald Ervin Knuth）出生于 1938 年 1 月 10 日，是美国计算机科学家、数学家，斯坦福大学名誉教授。他被称为“算法分析之父”，是 1974 年 ACM 图灵奖的获得者。 其图灵奖颁奖词为“表彰他对算法分析和编程语言设计的突出贡献，特别是他通过著作对“计算机程序设计艺术”的贡献，。”（For his major contributions to the analysis of algorithms and the design of programming languages, and in particular for his contributions to the “art of computer programming” through his well-known books in a continuous series by this title）。 他是多卷本著作《计算机程序设计艺术》（TAOCP）的作者，借其推动了算法计算复杂性的严格分析和系统化形式数学技术的发展。此书仍在创作！在著书过程中，他还推广了大 O 符号（渐进符号，asymptotic notation）。 高德纳还是 TeX 计算机排版系统，METAFONT 字体定义语言和渲染系统，以及计算机现代字体簇的创建者。另外，他还创建了 WEB 和 CWEB 计算机编程系统，旨在鼓励和促进文学编程（literate programming），并设计了 MIX/MMIX 指令集架构。 生平Knuth 于 1938 年出生于威斯康星州密尔沃基。 1956 年获得了位于俄亥俄州克利夫兰的凯斯理工学院（现为凯斯西储大学的一部分）的物理学奖学金，并入学。在校学习物理学时，Knuth 接触到了早期的商用计算机 IBM 650。阅读计算机手册后，Knuth 决定为他学校使用的机器重写汇编和编译代码。 随后他从物理学转向数学，并于 1960 年毕业时，由于他的杰出表现，同时获得学士与硕士学位。 1963 年，在数学家 Marshall Hall 的指导下，Knuth 以论文《有限半场与射影平面》（Finite Semifields and Projective Planes）获得加州理工学院数学博士学位。 获得博士学位后，Knuth 以助理教授的身份加入了加州理工学院。 1969 年，Knuth 离开并加入斯坦福大学。 贡献 The Art of Computer Programming 《计算机程序设计艺术》 TeX, METAFONT, Computer Modern 排版系统，字体 Knuth’s up-arrow notation Knuth 的向上箭头表示法，非常大的整数 Knuth–Morris–Pratt algorithm 字符串搜索算法 Knuth–Bendix completion algorithm 一种半决策算法 MMIX RISC 指令集 Robinson–Schensted–Knuth correspondence LR parser Literate programming ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/cad6d486/"},{"title":"图灵奖：埃德加·弗兰克·科德（1981）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 19 期。图灵奖：埃德加·弗兰克·科德（1981） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Edgar F. Codd，翻译基于 谷歌翻译. 埃德加·弗兰克·科德生于 1923 年 8 月 19 日，是一位英国计算机科学家。在为 IBM 工作期间，科德发明了数据库管理的关系模型，这是关系数据库和关系数据库管理系统的理论基础。 他于 1981 年获得图灵奖。 其图灵奖颁奖词为“表彰他对数据库管理系统的理论和实践做出的基础性和持续性贡献”。（For his fundamental and continuing contributions to the theory and practice of database management systems.） 生平科德出生于英格兰多塞特郡。 在第二次世界大战期间担任英国皇家空军海岸司令部的飞行员。 1948 年，他搬到纽约，在 IBM 担任数学程序员。 1953 年，在参议员约瑟夫·麦卡锡的激怒下，科德搬到了加拿大安大略省渥太华。 1957 年，他回到美国，在 IBM 工作，并于 1961 年至 1965 年在安娜堡的密歇根大学攻读计算机科学博士学位 两年后，他搬到加利福尼亚州圣何塞，在 IBM 的圣何塞研究实验室工作，并一直工作到 80 年代。 2003年4月18日，科德在佛罗里达州威廉姆斯岛的家中因心力衰竭去世，享年79岁。 贡献 Alpha language Database normalization OLAP Relational model ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/ebdab122/"},{"title":"图灵奖：奥利-约翰·达尔（2001）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 41 期。图灵奖：奥利-约翰·达尔（2001） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Ole-Johan Dahl，翻译基于 谷歌翻译. 面向对象编程之父之一 奥勒-约翰·达尔（Ole-Johan Dahl，1931 年 10 月 12 日－2002 年 6 月 29 日），挪威计算机科学家。 达尔是奥斯陆大学计算机科学教授，与 Kristen Nygaard 一起被认为是 Simula 和面向对象编程之父之一。 他于 2001 年获得图灵奖。 其图灵奖颁奖词为“与 Kristen Nygaard 合作，通过设计编程语言 Simula I 和 Simula 67，诞生面向对象编程的基本思想”。（With Kristen Nygaard, for ideas fundamental to the emergence of object oriented programming, through their design of the programming languages Simula I and Simula 67. ） 生平达尔出生于挪威的曼达尔。当他 13 岁的时候，二战期间德国占领挪威期间，他们全家逃到了瑞典。 战争结束后，达尔在奥斯陆大学学习计算数学。 达尔于 1968 年成为奥斯陆大学的教授，在这里，他致力于《分层程序结构》（Hierarchical Program Structures）的研究，这可能是他最有影响力的出版物，与 C.A.R. Hoare （1980 年图灵奖获得者） 共同撰写。 Dahl、Edsger Dijkstra 和 Hoare 于 1972 年合著的《结构化编程》（Structured Programming），可能是 20 世纪 70 年代最著名的关于软件的学术书籍。 随着职业生涯的发展，达尔对形式化方法（formal methods）的应用越来越感兴趣，例如严格的推理面向对象。 达尔被广泛认为是挪威最重要的计算机科学家。 面向对象 OO20 世纪 60 年代，作为 Simula I 和 Simula 67 仿真编程语言的一部分，达尔与 Kristen Nygaard 一起在挪威计算中心 (Norsk Regnesentral (NR)) 提出了面向对象 (OO) 编程的初步想法。这最初是 ALGOL 60 的扩展变体和超集。 达尔 和 Nygaard 是第一个提出类、子类（允许隐式信息隐藏）、继承、动态对象创建等概念的人，这些都是面向对象（OO）范式的重要概念。 对象是软件系统中的独立组件（具有数据结构和关联的过程或方法）。这些结合起来就形成了一个完整的系统。 面向对象的方法现在在现代软件开发中很普遍，包括广泛使用的命令式编程语言，例如 C++ 和 Java。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/42eaab69/"},{"title":"图灵奖：姚期智（2000）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 40 期。图灵奖：姚期智（2000） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Andrew Yao，翻译基于 谷歌翻译. 姚期智（Andrew Chi-Chih Yao，1946 年 12 月 24 日－），湖北孝感人，生于上海，中国计算机科学家、计算理论学家。 现任清华大学教授、交叉信息研究院院长。姚使用极小极大定理证明了现在所谓的姚氏原理。 姚曾入籍美国，并在美国工作多年。2015 年，他与杨振宁一起放弃美国公民身份，成为中国科学院院士。 他于 2000 年获得图灵奖。也是目前唯一一位获得此奖项的华人。 其图灵奖颁奖词为“表彰他对计算理论的基本贡献，包括基于复杂性的伪随机数生成理论、密码学和通信复杂性”。（*In recognition of his fundamental contributions to the theory of computation, including the complexity-based theory of pseudorandom number generation, cryptography, and communication complexity. ） 生平姚在国立台湾大学完成了物理学本科教育，随后于 1972 年在哈佛大学获得了物理学哲学博士学位，又于 1975 年在伊利诺伊大学厄巴纳-香槟分校获得了第二个计算机科学博士学位。 姚曾任麻省理工学院助理教授（1975-1976）、斯坦福大学助理教授（1976-1981，1982-1986）、加州大学伯克利分校教授（1981-1982）、普林斯顿大学工程与应用科学 William and Edna Macaleer 教授（1986-2004）. 2004年，姚成为清华大学高等研究中心（CASTU）教授和清华大学理论计算机科学研究所（ITCS）所长。2010年起担任清华大学交叉信息研究院院长。 贡献姚长期从事计算机科学和量子信息科学研究，在三大方面做出突出贡献： 创建理论计算机科学的重要次领域：通讯复杂性和伪随机数生成计算理论； 奠定现代密码学基础，在基于复杂性的密码学和安全形式化方法方面有根本性贡献； 解决线路复杂性、计算几何、数据结构及量子计算等领域的开放性问题并建立全新典范。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/9c51281d/"},{"title":"图灵奖：威廉·卡韩（1989）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 29 期。图灵奖：威廉·卡韩（1989） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:William Kahan，翻译基于 谷歌翻译. 浮点数之父 威廉·莫顿·卡韩（William Morton Kahan，1933 年 6 月 5 日出生）是一位加拿大数学家和计算机科学家。 他于 1989 年获得图灵奖。 其图灵奖颁奖词为“表彰他对数值分析的基本贡献。浮点计算领域最重要的专家之一。卡韩致力于‘让数值计算的世界变得安全！’”。（For his fundamental contributions to numerical analysis. One of the foremost experts on floating-point computations. Kahan has dedicated himself to “making the world safe for numerical computations!”） 生平卡韩出生于加拿大，就读于多伦多大学，于 1954 年获得学士学位，1956 年获得硕士学位，1956 年获得博士学位，且专业方向全部为数学。 他现在是加州大学伯克利分校数学、电气工程和计算机科学 (EECS) 名誉教授。 浮点数卡韩是浮点计算 IEEE 754-1985 标准，以及与基数无关的后续标准 IEEE 854，背后的主要架构师。 他被称为“浮点之父”，因为他在创建原始 IEEE 754 规范方面发挥了重要作用。 而后继续对 IEEE 754 修订版做出贡献，最终形成了当前的 IEEE 754 标准。 他还开发了卡韩求和算法，这是一种在将有限精度浮点数相加时引入的误差最小化的重要算法。 贡献 IEEE 754 Kahan summation algorithm the term “Table-maker’s dilemma” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/6c602883/"},{"title":"图灵奖：尤里斯·哈特马尼斯（1993）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 32 期。图灵奖：尤里斯·哈特马尼斯（1993） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Juris_Hartmanis，翻译基于 谷歌翻译. 计算复杂性理论（Computational complexity theory） 尤里斯·哈特马尼斯，（Juris Hartmanis，1928 年 7 月 5 日~ 2022 年 7 月 29 日），是一位出生于拉脱维亚的美国计算机科学家和计算理论家。 他与 Richard E. Stearns 一起获得了 1993 年 ACM 图灵奖。 其图灵奖颁奖词为“与理查德·E·斯特恩斯 (Richard E. Stearns) 合作，表彰他们为计算复杂性理论领域奠定基础的开创性论文”。（*With Richard E. Stearns, in recognition of their seminal paper which established the foundations for the field of computational complexity theory.*） 生平哈特马尼斯于 1928 年 7 月 5 日出生于拉脱维亚。他是拉脱维亚陆军将军马蒂斯·哈特马尼斯的儿子。他是诗人阿斯特丽德·伊瓦斯克的弟弟。 1940 年苏联占领拉脱维亚后，马蒂斯·哈特马尼斯被苏联逮捕并死在监狱中。 第二次世界大战后期，他的遗孀和孩子于 1944 年作为难民离开拉脱维亚。 他们首先搬到了德国，Juris Hartmanis 在那里获得了马尔堡大学物理学硕士学位的同等学位。 随后，他移居美国，于 1951 年在堪萨斯城大学（现称为密苏里大学堪萨斯城分校）获得应用数学硕士学位，并于 1955 年在 Robert P. Dilworth 的指导下获得加州理工学院数学博士学位。 随后，在康奈尔大学和俄亥俄州立大学教授数学后，Hartmanis 于 1958 年加入通用电气研究实验室。在通用电气期间，他发展了计算复杂性理论的许多原理。 1965年，他成为康奈尔大学教授。 他是该校计算机科学系（世界上最早的计算机科学系之一）的创始人之一和第一任系主任。 哈特马尼斯于 2022 年 7 月 29 日去世。 计算复杂性理论（Computational complexity theory）计算复杂性理论（Computational complexity theory）是理论计算机科学和数学的一个分支，它致力于将可计算问题根据它们本身的复杂性分类，以及将这些类别联系起来。一个可计算问题被认为是一个原则上可以用计算机解决的问题，亦即这个问题可以用一系列机械的数学步骤解决，例如算法。 1993 年，Hartmanis 和 R.E. 斯特恩斯获得了计算机科学领域的最高奖——图灵奖。 他们的论文定义了复杂性类的基本概念，这是一种根据解决计算问题所需的时间对计算问题进行分类的方法。 他们继续证明了许多基本结果，例如时间层次定理（Time hierarchy theorem）。 理查德·M·卡普 (Richard M. Karp) 在他自己的图灵奖演讲中指出，“Juris Hartmanis 和 Richard Stearns 于 1965 年发表的论文标志着复杂性理论现代时代的开始。” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/50cb0fc9/"},{"title":"图灵奖：尼克劳斯·维尔特（1984）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 23 期。图灵奖：尼克劳斯·维尔特（1984） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Niklaus Wirth，翻译基于 谷歌翻译. 他的书 “Algorithms + Data Structures = Programs”（算法+数据结构=程序）是计算机科学的名句。 尼克劳斯·埃米尔·维尔特（德语：Niklaus Emil Wirth，1934年2月15日—）是一位瑞士计算机科学家。 他设计了包括 Pascal 在内的多种编程语言，并开创了软件工程中的多个经典主题。 他于 1984 年获得图灵奖。 其图灵奖颁奖词为“开发一系列创新计算机语言：EULER、ALGOL-W、MODULA 和 PASCAL。 PASCAL 在教学上具有重要意义，并为未来的计算机语言、系统和体系结构研究提供了基础。”。（For developing a sequence of innovative computer languages, EULER, ALGOL-W, MODULA and PASCAL. PASCAL has become pedagogically significant and has provided a foundation for future computer language, systems, and architectural research.） 生平Wirth 1934 年出生于瑞士温特图尔。1959 年，他获得瑞士苏黎世联邦理工学院 (ETH Zürich) 电子工程理学学士学位。 1960 年，他获得加拿大拉瓦尔大学理学硕士学位。1963年，他获得加州大学伯克利分校电气工程和计算机科学博士学位，师从计算机设计先驱哈里·赫斯基（Harry Huskey）。 1968 年，他成为苏黎世联邦理工学院信息学教授，并在加州施乐帕洛阿尔托研究中心休了两次为期一年的休假（1976-1977 年和 1984-1985 年）。 1999年退休。 贡献（各种编程语言）Wirth 是以下编程语言的主设计师， Euler (1965)、 PL360 (1966)、 ALGOL W (1966)、 Pascal (1970)、 Modula (1975)、 Modula-2 (1978)、 Oberon (1987)、 Oberon-2 (1991)、 Oberon-07 (2007) 他还是下列操作系统团队的主要成员， Medos-2（1983 年，Lilith 工作站） Oberon（1987 年，Ceres 工作站） Lola（1995 年）数字硬件设计和实施 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/86214005/"},{"title":"图灵奖：巴特勒·兰普森（1992）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 32 期。图灵奖：巴特勒·兰普森（1992） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Butler Lampson，翻译基于 谷歌翻译. Alto系统 巴特勒·兰普森（Butler W. Lampson），生于 1943 年 12 月 23 日，是一位美国计算机科学家，因其对分布式个人计算的开发和应用的贡献而闻名。 他于 1992 年获得图灵奖。 其图灵奖颁奖词为“为分布式个人计算环境及其实现技术的开发做出贡献：工作站、网络、操作系统、编程系统、显示、安全和文档发布”。（*For contributions to the development of distributed, personal computing environments and the technology for their implementation: workstations, networks, operating systems, programming systems, displays, security and document publishing.*） 生平兰普森 1964 年获得哈佛大学物理学学士学位，并于 1967 年获得加州大学伯克利分校电气工程和计算机科学博士学位。 完成博士学位后，兰普森留在加州大学伯克利分校担任计算机科学助理教授（1967-1970）和副教授（1970-1971）。 1971 年，兰普森成为 Xerox PARC 的创始成员之一，在计算机科学实验室 (CSL) 担任首席科学家 (1971-1975) 和高级研究员 (1975-1983)。 1983 年，兰普森跟随他们的长期同事来到了数字设备公司的系统研究中心。 1995 年，兰普森前往微软研究院工作至今。 自 1987 年以来，兰普森一直担任麻省理工学院电气工程和计算机科学系的兼职教授。 贡献他著名的个人电脑的愿景被记录在 1972 年题为“为什么选择 Alto？”的备忘录中。 而后 1973 年，配备三键鼠标和全页显示器的 Xerox Alto 诞生，这被认为是第一台真正的的个人计算机。 在帕洛阿尔托研究中心（PARC），兰普森还协助研究了许多其他革命性技术，例如 激光打印机设计 两阶段提交协议 Bravo，第一个所见即所得文本格式化程序 以太网：第一个高速局域网（LAN） 多种有影响力的编程语言，例如 Euclid ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/f3bd70cd/"},{"title":"图灵奖：托尼·霍尔（1980）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 18 期。图灵奖：托尼·霍尔（1980） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Tony Hoare，翻译基于 谷歌翻译. 快排，霍尔逻辑，空指针，ALGOL，哲学家就餐！大神啊！ 托尼·霍尔爵士（Sir Charles Antony Richard Hoare）生于 1934 年 1 月 11 日），是一位英国计算机科学家，对编程语言、算法、操作系统、形式验证和并发计算做出了基础性贡献。 霍尔在 1959-1960 年开发了排序算法快速排序。然后开发了霍尔逻辑，这是验证程序正确性的公理基础。在并发语义中，他引入了形式语言通信顺序过程（CSP）来指定并发过程的交互，并与 Edsger Dijkstra 一起提出了哲学家就餐问题。 他还因空指针的开发（以及后来的自我批评）而受到赞誉，并将其引入了 ALGOL 系列语言中。 自 1977 年以来，他一直在牛津大学和剑桥微软研究院任职。 他于 1980 年获得图灵奖。 其图灵奖颁奖词为“表彰他对编程语言的定义和设计的基本贡献。”。（For his fundamental contributions to the definition and design of programming languages.） 生平托尼·霍尔 1934 年出生于锡兰科伦坡（现斯里兰卡），父母是英国人。 霍尔在英国本土接受教育。先是在英国牛津的 Dragon School 和坎特伯雷的 King’s School，而后在牛津的默顿学院（Merton College）学习古典学和哲学（“Greats”）。 1956 年毕业后，他在皇家海军服役了 18 个月，在那里他学习了俄语。 1958 年，他回到牛津大学，攻读统计学研究生（postgraduate）。正是在这里，他开始了计算机编程，由莱斯利·福克斯 (Leslie Fox) 在 Ferranti Mercury 上教学自动编码。然后，他作为英国文化协会交换生前往莫斯科国立大学，在那里，他在安德烈·科尔莫戈洛夫 (Andrey Kolmogorov) 的指导下学习机器翻译。 1960 年，霍尔离开苏联，开始在 Elliott Brothers 公司工作，这是一家位于伦敦的小型计算机制造公司。在那里，他实现了 ALGOL 60 语言并开始开发主要算法。 作为国际信息处理联合会 (IFIP) 算法语言和微积分工作组 2.1 的成员，他参与了编程和信息学方面的国际标准的制定。该工作组指定、维护和支持 ALGOL 60 和 ALGOL 68 语言。 1968 年，他成为贝尔法斯特女王大学计算机科学教授，并于 1977 年 Christopher Strachey 去世后，作为计算机教授返回牛津大学，领导牛津大学计算机实验室（现为牛津大学计算机科学系）的编程研究小组。他现在是该校的名誉教授，也是英国剑桥微软研究院的首席研究员。 在 2009 年的一次软件会议上，霍尔为发明空引用而道歉。 贡献 Quicksort Quickselect Hoare 逻辑 Structured Programming 形式语言通信顺序过程（CSP） ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/4089fec3/"},{"title":"图灵奖：弗雷德·布鲁克斯（1999）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 39 期。图灵奖：弗雷德·布鲁克斯（1999） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Fred Brooks，翻译基于 谷歌翻译. 著作《人月神话》 小弗雷德雷克·菲利普斯·“弗雷德”·布鲁克斯（Frederick Phillips Brooks Jr.，1931 年 4 月 19 日 – 2022 年 11 月 17 日），美国计算机架构师、软件工程师和计算机科学家，以管理 IBM System/360 系列计算机的开发和 OS/360 软件而闻名。开创性著作《人月神话》中记录了这些经历。 他于 1999 年获得图灵奖。 其图灵奖颁奖词为“对计算机体系结构、操作系统和软件工程的里程碑式贡献”。（For landmark contributions to computer architecture, operating systems, and software engineering. ） 生平布鲁克斯 1931 年 4 月 19 日出生于美国，1953 年于杜克大学获得物理学理学学士学位，1956 年获得哈佛大学应用数学（计算机科学）博士学位，导师为 Howard Aiken。 1956 年布鲁克斯加入 IBM，在纽约州波基普西和纽约州约克镇工作。他参与了 IBM 7030 Stretch 的架构设计，这是一台价值 1000 万美元的超级计算机。他还为国家安全局设计了 IBM 7950 Harvest 计算机。 随后，他成为 IBM System/360 系列计算机和 OS/360 软件包的开发经理。 在此期间，他创造了“计算机体系结构”一词。 1964 年，布鲁克斯接受邀请来到北卡罗来纳大学教堂山分校，并创建了该大学的计算机科学系。从此担任该委员会主席长达 20 年。 2004 年在计算机历史博物馆的一次演讲以及 2010 年《连线》(Wired)杂志的采访中，布鲁克斯被问到“你认为你最伟大的技术成就是什么？” 布鲁克斯回应道：“我做过的最重要的一个决定是将 IBM 360 系列从 6 位字节更改为 8 位字节，从而允许使用小写字母。而且这一修订被广泛采纳。 《人月神话》离开 IBM 几年后，他写了《人月神话》。撰写这本书的动机来自 IBM 时任首席执行官托马斯·J·沃森 (Thomas J. Watson Jr.)，他在布鲁克斯的离职采访中询问为什么管理软件项目比管理硬件项目困难得多。 在这本书中，布鲁克斯提出了现在著名的说法：“软件开发后期，添加人力只会使项目开发得更慢”（Adding manpower to a late software project makes it later），此后这被称为布鲁克斯定律。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/9fd2fc34/"},{"title":"图灵奖：拉吉·瑞迪（1994），生活大爆炸的Raj","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 33 期。图灵奖：拉吉·瑞迪（1994），生活大爆炸的Raj 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Raj Reddy，翻译基于 谷歌翻译. 《生活大爆炸》中 Raj 原型。今天的文章有主题曲。 拉吉·瑞迪（英语：Dabbala Rajagopal “Raj” Reddy，1937年6月13日—），印度裔美国计算机科学家，是人工智能的早期先驱之一，在斯坦福大学和卡内基梅隆大学任教超过 50 年，并且是卡内基梅隆大学机器人研究所的创始所长。 冷知识：拉吉·瑞迪还曾是李开复的博士生导师。 他因其在人工智能领域的工作获得了 1993 年 ACM 图灵奖。 其图灵奖颁奖词为“开创了大规模人工智能系统的设计和构建，展示了人工智能技术的实际重要性和潜在商业影响。”。（*For pioneering the design and construction of large scale artificial intelligence systems, demonstrating the practical importance and potential commercial impact of artificial intelligence technology.*） 生平拉杰·雷迪出生于现今印度安得拉邦 Chittoor 区卡图尔村的一个泰卢固语家庭，是家里第一个上大学的成员。（和剧中的富二代背景不同） 他于 1958 年在印度吉迪工程学院(CEG)获得土木工程学士学位，1960 年于澳大利亚新南威尔士大学获得工程硕士学位，1966 年获得斯坦福大学计算机科学博士学位。 1960 年起，他在澳大利亚IBM工作。博士毕业后，1966 年至 1969 年，他担任斯坦福大学计算机科学助理教授。1969 年，加入卡内基梅隆大学，担任计算机科学副教授。他于 1973 年成为正教授，并于 1984 年成为大学教授。 他于 1979 年至 1991 年担任卡内基梅隆大学机器人研究所的创始所长，并于 1991 年至 1999 年担任计算机科学学院院长，作为院长，他帮助创建了语言技术研究所、人类语言技术研究所、计算机交互研究所、自动学习与发现中心（后更名为机器学习系）和软件研究所。 AI 研究他的 AI 研究集中在智能感知和运动方面，如语音、语言、视觉和机器人技术。 在50年的时间里，雷迪和他的同事们创造了几个具有历史意义的口头语言系统演示，例如机器人的语音控制、大词汇量连接语音识别、与说话人无关的语音识别和不受限制的词汇听写。 雷迪和他的同事对面向任务的计算机架构、自然场景分析、信息的普遍获取和自主机器人系统做出了开创性的贡献。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/dae84a94/"},{"title":"图灵奖：曼纽尔·布卢姆（1995）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 35 期。图灵奖：曼纽尔·布卢姆（1995） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Edward Feigenbaum，翻译基于 谷歌翻译. 计算复杂性理论的主要奠基人之一 曼纽尔·布卢姆（Manuel Blum，1938 年 4 月 26 日出生）是一位出生于委内瑞拉的美国计算机科学家。 他于 1995 年获得图灵奖。 其图灵奖颁奖词为“表彰他对计算复杂性理论基础及其在密码学和编程校验中的应用的贡献。”。（In recognition of his contributions to the foundations of computational complexity theory and its application to cryptography and program checking. ） 生平布卢姆出生于委内瑞拉的一个犹太家庭。 他就读于麻省理工学院，分别于 1959 年和 1961 年获得电气工程学士学位和硕士学位，并于 1964 年在马文·明斯基 (Marvin Minsky) 的指导下获得数学博士学位。 布卢姆 2001 年之前一直在加州大学伯克利分校担任计算机科学教授。从 2001 年到 2018 年，他担任卡内基梅隆大学计算机科学的 Bruce Nelson 教授。 2006年，他因在抽象复杂性理论、归纳推理、密码协议以及程序检查器的理论和应用方面的贡献而当选为美国国家工程院院士。 贡献在 60 年代，他发展了一种独立于具体机器模型的公理复杂性理论。该理论基于哥德尔编号和布卢姆公理。尽管该理论不基于任何机器模型，但它产生了具体的结果，如压缩定理、间隙定理、诚实定理和布鲁姆加速定理。 他的其他一些工作包括在电话上掷硬币的协议、中位数的中位数（线性时间选择算法）、Blum Blum Shub 伪随机数生成器、Blum–Goldwasser 密码系统以及最近的验证码。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/86f7e529/"},{"title":"图灵奖：查尔斯·巴赫曼（1973）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 9 期。 本文来自 wiki: Charles_Bachman，翻译基于 腾讯交互翻译. 查尔斯·威廉·巴赫曼三世（Charles William Bachman III，1924年12月11日-2017年7月13日），美国计算机科学家，他的整个职业生涯都是作为工业研究员、开发人员和管理人员，而并非在学术界。他以在数据库管理系统的早期开发方面的工作闻名，包括以他命名的分层架构技术——巴赫曼图。 其图灵奖颁奖词为“表彰他对数据库技术的杰出贡献”（For his outstanding contributions to database technology）。 生平查尔斯·巴赫曼 1924 年出生于堪萨斯州曼哈顿，他的父亲小查尔斯·巴赫曼在是堪萨斯州立大学的橄榄球队主教练。 在第二次世界大战中，他加入了美国陆军，期间在防空炮兵部队服役时，他第一次接触并使用火力控制计算机来瞄准 90 毫米火炮。 1946 年退伍后，他进入密歇根州立大学，并获得机械工程学士学位。 此后他就读于宾夕法尼亚大学，于 1950 年获得了机械工程硕士学位。 巴赫曼于 2017 年 7 月 13 日因帕金森病，在马萨诸塞州列克星敦的家中去世，享年92岁。 贡献 集成数据存储 (IDS) IDS 在磁盘上维护了一组共享文件，以及用于构建和维护它们的工具。负责特定任务（例如计费或库存更新）的程序通过向 IDS 发送请求来检索和更新这些文件。 IDS 为应用程序程序员提供了一组强大的命令来操作数据，这是很快被称为数据操作语言的早期表达。 巴赫曼信息系统公司 该公司开发了一系列计算机辅助软件工程 (CASE) 产品。这些产品的核心是 BACHMAN/Data Analyst，它为 Bachman 图的创建和维护提供图形支持 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/c3319c64/"},{"title":"图灵奖：爱德华·费根鲍姆（1994）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 34 期。图灵奖：爱德华·费根鲍姆（1994） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Edward Feigenbaum，翻译基于 谷歌翻译. 专家系统之父 爱德华·艾伯特·费根鲍姆（Edward Albert Feigenbaum，1936 年 1 月 20 日出生）是一位从事人工智能领域工作的计算机科学家。 他通常被称为“专家系统之父”。 他因其在人工智能领域的工作与 Raj 共同获得了 1994 年 ACM 图灵奖。 其图灵奖颁奖词为“开创了大规模人工智能系统的设计和构建，展示了人工智能技术的实际重要性和潜在商业影响。”。（For pioneering the design and construction of large scale artificial intelligence systems, demonstrating the practical importance and potential commercial impact of artificial intelligence technology. ） 生平费根鲍姆 1936 年出生于美国新泽西州威霍肯的一个犹太文化家庭，后来搬到附近的北卑尔根，在那里生活到 16 岁，然后他离开去上大学。 他 1956 年于卡内基理工学院（现卡内基梅隆大学）获得了本科学位，并于1960 年获得了博士学位。 在赫伯特·A·西蒙 (Herbert A. Simon) 的指导完成的博士论文中，他开发了 EPAM，这是最早研究人们如何学习的计算机模型之一。 专家系统之父在人工智能领域，专家系统是模拟人类专家决策能力的计算机系统。 专家系统旨在通过知识体系进行推理来解决复杂问题，这些知识体系主要表示为 if-then 规则，而不是通过传统的程序代码。第一个专家系统创建于 20 世纪 70 年代，然后在 20 世纪 80 年代激增。 专家系统是最早真正成功的人工智能（AI）软件形式之一。 专家系统分为两个子系统：推理机和知识库。 知识库代表事实和规则。 推理机将规则应用于已知事实以推断出新事实。 推理引擎还可以包括解释和调试能力。 EPAMEPAM（Elementary Perceiver and Memorizer，基本感知器和记忆器）是一种以计算机程序形式实现的学习和记忆心理学理论。 它最初由 Herbert A. Simon 和 Edward Feigenbaum 设计，用于模拟言语学习中的现象，后来经过修改，用于解释专业知识心理学和概念形成的数据。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/f2c0c82f/"},{"title":"图灵奖：理查德·卡普（1985）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 24 期。图灵奖：理查德·卡普（1985） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Richard M. Karp，翻译基于 谷歌翻译. 理查德·曼宁·卡普（Richard Manning Karp，1935 年 1 月 3 日出生）是一位美国计算机科学家和计算理论家，因在 NP 完备性理论和应用、构建高效组合算法以及在计算机科学中应用概率方法方面做出的重大贡献而知名。 他于 1985 年获得图灵奖。 其图灵奖颁奖词为“表彰他对算法理论的持续贡献，包括开发网络流和其他组合优化问题的有效算法、用算法效率的直观概念识别多项式时间可计算性，以及最值得注意的是对NP-完整性理论的贡献。Karp 引入了现在的标准方法来证明问题是 NP 完全的，这导致许多理论和实际问题在计算上是困难的。”。（For his continuing contributions to the theory of algorithms including the development of efficient algorithms for network flow and other combinatorial optimization problems, the identification of polynomial-time computability with the intuitive notion of algorithmic efficiency, and, most notably, contributions to the theory of NP-completeness. Karp introduced the now standard methodology for proving problems to be NP-complete which has led to the identification of many theoretical and practical problems as being computationally difficult.） 生平Karp 出生于波士顿马萨诸塞州。 他 1955 年于哈佛大学获得学士学位，1956 年获得硕士学位，1959 年获得应用数学博士学位。随后，在 IBM 的 Thomas J. Watson 研究中心开始工作。 1968年，他成为加州大学伯克利分校计算机科学、数学和运筹学教授。 除了在华盛顿大学担任教授四年外，从 1988 年到 1995 年以及 1999 年至今，他一直留在伯克利大学。他还担任伯克利国际计算机科学研究所的研究科学家，目前领导该研究所的算法小组。 2012 年，卡普成为加州大学伯克利分校西蒙斯计算理论研究所的创始主任。 研究工作 1962 年，他与 Michael Held 共同开发了 Held-Karp 算法，这是一种针对旅行商问题的精确指数时间算法 1971 年，他与 Jack Edmonds 共同开发了 Edmonds-Karp 算法，用于解决网络上的最大流问题，并于 1972 年发表了复杂性理论中具有里程碑意义的论文“组合问题的可归约性”，其中他证明了 21 个问题 NP 完全 1973 年，他和 John Hopcroft 发表了 Hopcroft-Karp 算法，这是已知在二部图中查找最大基数匹配的最快方法 1980 年，卡普与理查德·J·利普顿 (Richard J. Lipton) 一起证明了卡普-利普顿定理（该定理证明，如果 SAT 可以通过具有多项式逻辑门数的布尔电路来求解，则多项式层次结构会崩溃到第二层） 1987 年，他与 Michael O. Rabin 共同开发了 Rabin-Karp 字符串搜索算法 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/b8a6ce51/"},{"title":"图灵奖：理查德·斯特恩斯（1993）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 32 期。图灵奖：理查德·斯特恩斯（1993） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Richard E. Stearns，翻译基于 谷歌翻译. 计算复杂性理论（Computational complexity theory） 理查德·斯特恩斯，（Richard Edwin Stearns， 1936 年 7 月 5 日出生），美国计算机科学家。 他与 Juris Hartmanis 一起获得了 1993 年 ACM 图灵奖。 其图灵奖颁奖词为“与尤里斯·哈特马尼斯 (Juris Hartmanis) 合作，表彰他们为计算复杂性理论领域奠定基础的开创性论文”。（*With Juris Hartmanis, in recognition of their seminal paper which established the foundations for the field of computational complexity theory.*） 生平斯特恩斯于 1958 年获得卡尔顿学院数学学士学位，获得博士学位。 1961 年，在哈罗德·W·库恩 (Harold W. Kuhn) 的指导下完成题为“无额外支付的三人合作游戏”（Three person cooperative games without side payments）的博士论文后，获得普林斯顿大学数学博士学位。 斯特恩斯现在是纽约州立大学奥尔巴尼大学计算机科学系的杰出名誉教授。 计算复杂性理论（Computational complexity theory）计算复杂性理论（Computational complexity theory）是理论计算机科学和数学的一个分支，它致力于将可计算问题根据它们本身的复杂性分类，以及将这些类别联系起来。一个可计算问题被认为是一个原则上可以用计算机解决的问题，亦即这个问题可以用一系列机械的数学步骤解决，例如算法。 1993 年，Hartmanis 和 R.E. 斯特恩斯获得了计算机科学领域的最高奖——图灵奖。 他们的论文定义了复杂性类的基本概念，这是一种根据解决计算问题所需的时间对计算问题进行分类的方法。 他们继续证明了许多基本结果，例如时间层次定理（Time hierarchy theorem）。 理查德·M·卡普 (Richard M. Karp) 在他自己的图灵奖演讲中指出，“Juris Hartmanis 和 Richard Stearns 于 1965 年发表的论文标志着复杂性理论现代时代的开始。” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/e997b43c/"},{"title":"图灵奖：理查德·汉明（1968）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 4 期。 本文来自 wiki: Richard Hamming，翻译基于 腾讯交互翻译. 理查德·卫斯理·汉明（英语：Richard Wesley Hamming，1915 年2 月 11 日-1998 年 1 月 7 日）是一位美国数学家，他的工作对计算机工程和电信领域有深远影响。 “汉明码”系列应用是他的主要贡献。 出生于芝加哥的汉明曾就读于芝加哥大学、内布拉斯加大学和伊利诺伊大学香槟分校，并在瓦尔德马·特日津斯基（Waldemar Trjitzinsky，1901-1973）的指导下完成了数学博士论文。 1945 年 4 月，他加入了 Los Alamos 实验室的曼哈顿计划，在那里他使用 IBM 计算机器编程，求解该计划中的物理学家提供的方程。 1946 年，他离开并加入了贝尔电话实验室。并在接下来的 15 年里，他参与了那些几乎实验室所有的突出成就。1968 年，他因此成为图灵奖的第三位获奖者。 1976 年，从贝尔实验室退休后，汉明在加州州蒙特雷的海军研究生院担任计算机科学的副教授和高级讲师，并致力于教学和写书。在 1997 年 12 月，他发表了他的最后一次演讲。 1998 年 1 月 7 日汉明死于心脏病发作。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/b662b17c/"},{"title":"图灵奖：简介","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 1 期。 本文来自wiki：Turing Award 图灵奖（ACM A. M. Turing Award）是由美国计算机协会（ACM）颁发的年度奖项，以表彰获奖者对计算机科学做出的影响深远的重大技术贡献。它被公认为计算机科学领域的最高荣誉，有”计算机界的诺贝尔奖”的俗称。 该奖项是以英国数学家、曼彻斯特大学数学系 reader（这是一种高级头衔，不是读者的意思）艾伦·图灵（Alan Mathison Turing）的名字命名的。图灵通常被认为是理论计算机科学和人工智能的主要开创者。 从 2007 年到 2013 年，该奖项还获得了 25 万美元、由英特尔和谷歌赞助的额外奖金。自 2014 年起，该奖项的奖金为 100 万美元，由谷歌提供资金支持。 1966 年，卡内基梅隆大学（CMU）的艾伦·佩利斯（Alan Perlis）是第一位获奖者。 第一位女性获奖者是 2006 年 IBM 的法兰西斯·艾伦（Frances E. Allen）。 2021 年的最新获奖者是田纳西大学的杰克·唐加拉（Jack J. Dongarra）。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/25f18018/"},{"title":"图灵奖：约翰·巴克斯（1977）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 15 期。图灵奖：约翰·巴克斯（1977） 本文来自 wiki:John Backus，翻译基于 腾讯交互翻译. 约翰·华纳·巴克斯（英语：John Warner Backus，1924 年 12 月 3 日-2007 年 3 月 17 日），美国计算机科学家。他领导的团队发明并实现了 FORTRAN，这是第一种广泛使用的高级编程语言。他也是巴科斯范式（BNF）的提出者，这是一种广泛使用的、用来定义形式语言语法的记号法。 他于 1977 年获得图灵奖。 其图灵奖颁奖词为“对实用高级编程系统设计的深刻、有影响和持久的贡献，特别是通过他在 FORTRAN 方面的工作，以及对编程语言规范化的开创性出版物”。（For profound, influential, and lasting contributions to the design of practical high-level programming systems, notably through his work on FORTRAN, and for seminal publication of formal procedures for the specification of programming languages.） 生平巴克斯 1924 年 12 月 3 日出生于美国宾夕法尼亚州费城。 他曾就读于宾夕法尼亚州波茨敦的希尔学校，但他显然不是一个勤奋的学生。 而后他进入弗吉尼亚大学学习化学，但在那里的学业进行的很艰难，不到一年就因出勤率低而被开除。 随后，他在第二次世界大战期间被征召入伍，并最终获得下士军衔，负责指挥驻扎在佐治亚州斯图尔特堡的防空炮台。 在军事能力测试中获得高分后，陆军派他去匹兹堡大学学习工程学。他后来转到哈弗福德学院的医学预科课程。在医院实习期间，他被诊断出患有颅骨肿瘤，成功切除后还在头部安装了钢板。 在这个过程中，他对数学产生极大兴趣，于是去往哥伦比亚大学学习，并于 1949 年由数学专业获得硕士学位。 1950 年，他加入 IBM，并开始了漫长的工作生涯。 1957 年 4 月他所领导 13 人小组推出全世界第一套高阶电脑语言 FORTRAN，并首次在 IBM 704 计算机上面使用。 1977 年 10 月 17 日在西雅图举行的 ACM 年会上，他获得图灵奖。会中，他发表了“程序设计能从冯诺伊曼形式中解脱出来吗？函数式风格及其程序的代数”（Can Programming be Liberated from the von Neumann Style? A Functional Style and Its Algebra of Programs）演讲，提出了叫做 FP 的函数级编程语言。 他于 1991 年退休，并于 2007 年 3 月 17 日在俄勒冈州阿什兰的家中去世。 贡献 Fortran Backus–Naur form，BNF Function-level programming ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/bf7cc272/"},{"title":"图灵奖：约翰·科克（1987）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 27 期。图灵奖：约翰·科克（1987） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:John Cocke，翻译基于 谷歌翻译. 中国的老朋友，上过《开讲啦》 约翰·科克（John Cocke，1925 年 5 月 30 日－2002 年 7 月 16 日）,美国计算机科学家，因其对计算机体系结构和优化编译器设计的巨大贡献而受到认可。 他被许多人认为是“RISC 架构之父”。 他于 1987 年获得图灵奖。 其图灵奖颁奖词为“在编译器的设计和理论、大型系统的体系结构以及精简指令集计算机（RISC）的开发方面做出了重大贡献； 发现和系统化现在用于优化编译器的许多基本转换，包括减少运算符强度、消除公共子表达式、寄存器分配、常量传播和死代码消除。”。（For significant contributions in the design and theory of compilers, the architecture of large systems and the development of reduced instruction set computers (RISC); for discovering and systematizing many fundamental transformations now used in optimizing compilers including reduction of operator strength, elimination of common subexpressions, register allocation, constant propagation, and dead code elimination.） 生平科克出生于美国北卡罗来纳州夏洛特。 他于 1946 年在杜克大学获得机械工程学士学位，并于 1956 年获得数学博士学位。 从 1956 年到 1992 年，Cocke 的整个职业生涯都是在 IBM 担任工业研究员。 RISC，精简指令集他的创新最引人注目的项目是 IBM 801 小型计算机。他发现将架构指令集的设计与编译器实际相对简单的指令相匹配可以以低成本实现高性能。 CYK 算法他是CYK算法（C代表Cocke）的发明者之一。 CYK算法（英语：Cocke–Younger–Kasami algorithm，缩写为CYK algorithm）是由约翰·科克，Younger和嵩忠雄共同研究。它是基于动态规划思想设计的一种自底向上语法分析算法，被用来判定任意给定的字符串 $w\\in \\Sigma^$ 是否属于一个上下文无关文法*。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/7453f851/"},{"title":"图灵奖：约翰·霍普克洛夫特（1986）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 25 期。图灵奖：约翰·霍普克洛夫特（1986） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:John Hopcroft，翻译基于 谷歌翻译. 中国的老朋友，上过《开讲啦》 约翰·爱德华·霍普克罗夫特（John Edward Hopcroft，1939 年 10 月 7 日出生），美国理论计算机科学家。他的计算理论教科书（也称为灰姑娘书）和数据结构教科书被视为各自领域的标准。他是康奈尔大学计算机科学工程与应用数学 IBM 教授，北京大学计算前沿研究中心联席主任。 他于 1986 年获得图灵奖。 其图灵奖颁奖词为“与 Robert E Tarjan 一起，在算法和数据结构的设计和分析方面取得了基础性成就”。（With Robert E Tarjan, for fundamental achievements in the design and analysis of algorithms and data structures.） 生平约翰·霍普克罗夫特 (John Hopcroft) 1939 年 10 月 7 日出生于华盛顿州西雅图。 约翰在西雅图长大并就读于当地学校。 1961 年在西雅图大学获得学士学位，而后分别于1962年和1964年获得斯坦福大学硕士、博士学位。 约翰的第一份学术工作是担任普林斯顿大学电气工程助理教授。当他的系主任要求他教授计算机科学课程时，他几乎是偶然地成为了一名计算机科学家。 杰夫·厄尔曼（Jeff Ullman）是第一批学生之一，他后来成为他工作的主要合作者（共同获得 2010 年 IEEE 约翰·冯·诺依曼奖）。 他在普林斯顿大学工作了三年，此后一直在康奈尔大学工作。 约翰不仅是一位受人尊敬的研究员，也是一位鼓舞人心的老师。他认为应该要求学生减少选修专业课程。应该允许他们接受广泛的教育，并有更多的自由时间自学。他承认，他在改变大学课程要求方面取得的成功有限，但他仍在尝试。 在中国的痕迹 《开讲啦》有更多内容 中国科学院外籍院士，与北京理工大学、云南大学、重庆大学、上海交通大学、香港科技大学等高校有交集。 2016 年获得友谊奖（中国）。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/aa8d57f5/"},{"title":"图灵奖：约翰·麦卡锡（1971）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 7 期。 本文来自 wiki:John_McCarthy，翻译基于 腾讯交互翻译. 约翰·麦卡锡（John McCarthy，1927年9月4日-2011年10月24日），美国计算机科学家和认知科学家。 他是人工智能（AI）这一学科的创始人之一。 麦卡锡的大部分职业生涯都在斯坦福大学度过。 因其在人工智能领域的卓越成就，他被授予 1971 年的图灵奖。 生平约翰·麦卡锡于 1927 年 9 月 4 日出生于马萨诸塞州州波士顿，父亲是爱尔兰移民，母亲是立陶宛犹太移民。 他于 1944 年被加州理工学院录取。但他因体育课的问题被加州理工学院听雪。接下来，他在美国陆军服役后，被加州理工再次录取，并于 1948 年获得学士学位。 在加州理工学院，他听了冯诺依曼的讲座，从此激发了他再后来的努力。 1951 年，他在普林斯顿大学完成了题为“投影算子和偏微分方程”（Projection operators and partial differential equations）的博士论文，并获得博士学位。 贡献他 与人合著的文档创造了“人工智能”（AI）一词； 开发了编程语言系列 Lisp，显著影响了语言ALGOL的设计，推广了分时（time-sharing），并发明了垃圾回收机制。 彩蛋：他是著名的达特茅斯会议参会者之一，你知道其他几位都是谁吗？ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/3ff45f0/"},{"title":"图灵奖：罗伯特·塔扬（1986）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 25 期。图灵奖：罗伯特·塔扬（1986） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Robert Tarjan，翻译基于 谷歌翻译. 中国的老朋友，上过《开讲啦》 罗伯特·恩德烈·塔扬（Robert Endre Tarjan，1948 年 4 月 30 日出生）是一位美国计算机科学家和数学家。 他是多个图论算法的发现者，包括强连通分量算法，也是展开树和斐波那契堆的共同发明者。 Tarjan 目前是普林斯顿大学计算机科学系 James S. McDonnell 杰出教授。 他于 1986 年获得图灵奖。 其图灵奖颁奖词为“与 John E Hopcroft 一起，在算法和数据结构的设计和分析方面取得了基础性成就”。（With John E Hopcroft, for fundamental achievements in the design and analysis of algorithms and data structures.） 生平塔扬出生于加利福尼亚州波莫纳。小时候，塔扬读了很多科幻小说，并想成为一名天文学家。在阅读《科学美国人》上马丁·加德纳的数学游戏专栏后，他对数学产生了兴趣。 塔扬于 1969 年获得加州理工学院数学学士学位。1971 年在斯坦福大学获得计算机科学硕士学位，1972 年获得计算机科学博士学位（辅修数学），他的博士论文是一种高效的平面算法（An Efficient Planarity Algorithm） 在斯坦福大学，他的导师是 Robert Floyd 和 Donald Knuth。 。 算法和数据结构塔扬以其在图论算法和数据结构方面的开创性工作而闻名。 他的一些著名算法包括 Tarjan 的离线最小公共祖先算法和 Tarjan 的强连通分量算法，他是中位数线性时间选择算法的五位合著者之一。 Hopcroft-Tarjan 平面度测试算法是第一个用于平面度测试的线性时间算法。 塔扬还开发了重要的数据结构，例如斐波那契堆（一种由树木组成的堆数据结构）和展开树（一种自我调整的二叉搜索树；由 Tarjan 和 Daniel Sleator 共同发明）。 另一个重要贡献是对不相交集数据结构的分析； 他是第一个证明涉及逆阿克曼函数的最佳运行时间的人。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/a724ce79/"},{"title":"图灵奖：罗伯特·弗洛伊德（1978）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 16 期。图灵奖：罗伯特·弗洛伊德（1978） 本文来自 wiki:Robert W. Floyd，翻译基于 谷歌翻译. 知识点：图最短路径算法——弗洛伊德算法 罗伯特·W·弗洛伊德（1936 年 6 月 8 日 - 2001 年 9 月 25 日），美国计算机科学家。他设计了 Floyd-Warshall 算法，该算法可以有效地找到图中的所有最短路径。他在一篇论文中介绍了渲染图像的误差扩散的重要概念，也称为 Floyd–Steinberg 抖动（尽管他区分了抖动和扩散）。他在 1967 年发表的论文《Assigning Meanings to Programs》中开创了使用逻辑断言进行程序验证的领域，这是对后来的 Hoare 逻辑的贡献。 他于 1978 年获得图灵奖。 其图灵奖颁奖词为“对创建高效可靠软件的方法论产生了显著影响，并帮助建立了计算机科学的以下重要子领域：解析理论、编程语言语义、自动程序验证、自动程序合成以及算法分析。”。（For having a clear influence on methodologies for the creation of efficient and reliable software, and for helping to found the following important subfields of computer science: the theory of parsing, the semantics of programming languages, automatic program verification, automatic program synthesis, and analysis of algorithms.） 生平弗洛伊德 1936 年出生于纽约市，14 岁高中毕业。 1953 年（当时年仅 17 岁）在芝加哥大学获得文科学士学位 (B.A.)，并于 1958 年获得物理学的学士学位。 弗洛伊德于 20 世纪 50 年代成为伊利诺伊理工学院装甲研究基金会（现为 IIT 研究所）的一名工作人员。 在 20 世纪 60 年代初成为计算机操作员后，他开始发表许多论文，包括有关编译器（尤其是解析）的论文。他是运算符优先语法的先驱，并因开创了编程语言的语义领域而备受赞赏。 27 岁时，他被任命为卡内基梅隆大学副教授，6 年后成为斯坦福大学正教授。 注意，他是本科。 弗洛伊德与唐纳德·高德纳 (Donald Knuth) 合作密切，是高德纳 (Donald Knuth) 的开创性著作《计算机编程的艺术》(The Art of Computer Programming) 的主要审稿人，并且是该著作中被引用次数最多的人。 而后，他罹患皮克氏病（一种神经退行性疾病），因此于 1994 年初退休。 2001 年 9 月 25 日去世。 他的爱好包括徒步旅行，而且他还是一位狂热的西洋双陆棋玩家。 贡献 Floyd–Warshall algorithm Floyd–Steinberg dithering Floyd’s cycle-finding algorithm Floyd’s triangle ALGOL ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/4e320f50/"},{"title":"图灵奖：罗宾·米尔纳（1991）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 31 期。图灵奖：罗宾·米尔纳（1991） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Robin Milner，翻译基于 谷歌翻译. 分时操作系统 亚瑟·约翰·罗宾·戈雷尔·米尔纳 FRS（Arthur John Robin Gorell Milner，FRS，1934 年 1 月 13 日 – 2010 年 3 月 20 日）是一位英国计算机科学家。 他于 1991 年获得图灵奖。 其图灵奖颁奖词为“获得三项独特且完整的成就：1. LCF，斯科特可计算函数逻辑的机制，可能是第一个基于理论且实用的机器辅助证明构建工具；2. ML，第一种包含多态类型推断和类型安全异常处理机制的语言；3. CCS，并发的一般理论。此外，他还提出并大力推进了完全抽象，即操作语义和指称语义之间关系的研究。”。（*For three distinct and complete achievements:1. LCF, the mechanization of Scott’s Logic of Computable Functions, probably the first theoretically based yet practical tool for machine assisted proof construction;2. ML, the first language to include polymorphic type inference together with a type-safe exception-handling mechanism;3. CCS, a general theory of concurrency. In addition, he formulated and strongly advanced full abstraction, the study of the relationship between operational and denotational semantics.*） 生平米尔纳出生于英国普利茅斯附近耶尔普顿的一个军人家庭。 他就读于剑桥大学国王学院，并于 1957 年毕业。 米尔纳先是一名教师，然后在 Ferranti 担任程序员，之后进入伦敦城市大学、斯旺西大学、斯坦福大学的学术界，并从 1973 年开始在爱丁堡大学工作，他是计算机科学基础实验室 (LFCS) 的联合创始人。 1995 年，他回到剑桥，担任计算机实验室的负责人，但最终辞职。 自 2009 年起，米尔纳担任苏格兰信息学与计算机科学联盟高级研究员，并担任（兼职）爱丁堡大学计算机科学系主任。 米尔纳于 2010 年 3 月 20 日在剑桥因心脏病去世。 贡献 LCF，Logic for Computable Functions 最早的自动定理证明（Automated theorem proving, ATP）工具之一 ML 他为LCF开发的语言ML是第一个具有多态类型推断和类型安全异常处理的语言 通信系统演算(CCS)，$\\pi$-演算 分析并发系统的理论框架，即通信系统演算(CCS)及其继承者π演算 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/c9c3354d/"},{"title":"图灵奖：肯·汤普逊（1983）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 22 期。图灵奖：肯·汤普逊（1983） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Ken Thompson，翻译基于 谷歌翻译. 所有程序员都知道的 K&amp;R 肯尼思·莱恩·汤普森（Kenneth Lane Thompson，1943 年 2 月 4 日出生）是美国计算机科学先驱，他的大部分职业生涯都在贝尔实验室工作。 他因创建 C 编程语言（名著《K&amp;R》的K）而闻名，并与同事丹尼斯·里奇一起创建了 Unix 操作系统和 B 编程语言。 除了各种下文中赫赫有名的工作，他还有在计算机国际象棋方面的贡献，包括创建残局表库和国际象棋机器 Belle。 他于 1983 年与丹尼斯·里奇一起获得图灵奖。 其图灵奖颁奖词为“与 Dennis M. Ritchie 一起开发了通用操作系统理论并专门用于 UNIX 操作系统的实现”。（With Dennis M. Ritchie, for their development of generic operating systems theory and specifically for the implementation of the UNIX operating system.） 生平Thompson 出生于路易斯安那州的新奥尔良。 他于 1965 年在加州大学伯克利分校获得了电气工程和计算机科学理学学士学位，并于 1966 年获得了硕士学位。 UNIXThompson 于 1966 年受聘于贝尔实验室。在 20 世纪 60 年代，在贝尔实验室，Thompson 和 Dennis Ritchie 致力于 Multics 操作系统的开发。 在编写 Multics 时，Thompson 创建了 Bon 编程语言。后来，贝尔实验室退出了 Multics 项目。为了继续玩游戏，汤普森找到了一台旧的 PDP-7 机器并在上面重写了由他自己开发的视频游戏《太空旅行》。 最终，Thompson 开发的这些工具成就了 Unix 操作系统，包括由 Thompson 和 Ritchie 领导的贝尔实验室研究人员团队在 PDP-7 上开发的分层文件系统、计算机进程和设备的概念 文件、命令行解释器、用于轻松进程间通信的管道以及一些小型实用程序。 B语言在对 Unix 进行初步研究后，Thompson 认为 Unix 需要一种系统编程语言并创建了 B，它是 Ritchie 的 C 的前身。 Go语言自 2006 年以来，Thompson 一直在 Google 工作，与他人共同开发了 Go 编程语言。 UTF-81992年，Thompson与Rob Pike一起开发了UTF-8编码方案。 UTF-8 编码从此成为万维网的主导字符编码，占 2019 年所有网页的 90% 以上。 正则表达式20 世纪 60 年代，Thompson 也开始研究正则表达式。 Thompson 开发了 QED 编辑器的 CTSS 版本，其中包括用于搜索文本的正则表达式。 值得一提的是，他是著名搜索指令 grep 的作者。 贡献 Multics Unix B (programming language) Belle (chess machine) UTF-8 Plan 9 from Bell Labs Inferno (operating system) grep Endgame tablebase Go ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/278b050c/"},{"title":"图灵奖：肯尼斯·艾佛森（1979）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 17 期。图灵奖：肯尼斯·艾佛森（1979） 本文来自 wiki:Kenneth E. Iverson，翻译基于 谷歌翻译. 肯尼思·尤金·艾弗森（Kenneth Eugene Iverson，1920 年 12 月 17 日—— 2004 年 10 月 19 日），加拿大计算机科学家，因开发编程语言 APL 而闻名。 他于 1979 年获得图灵奖。 其图灵奖颁奖词为“表彰他在编程语言和数学符号方面的开创性努力，以至产生了现在被称为 APL 的计算科学领域；表彰他对交互式系统的实现、APL 的教育应用以及编程语言理论和实践的贡献”。（For his pioneering effort in programming languages and mathematical notation resulting in what the computing field now knows as APL, for his contributions to the implementation of interactive systems, to educational uses of APL, and to programming language theory and practice.） 生平艾佛森于 1920 年 12 月 17 日出生于加拿大阿尔伯塔省中部小镇卡姆罗斯附近。他的父母都是农民。 第二次世界大战期间，他先在加拿大陆军服役，然后在加拿大皇家空军服役。 他于女王大学获得了文学学士学位。 女王大学学士学位。然后于哈佛大学获得硕士和博士学位。 而后先后就职于哈佛大学、IBM、I. P. Sharp Associates 和 Jsoftware 公司。 2004 年 10 月 16 日，艾佛森在新 J 实验室工作时中风，于 2004 年 10 月 19 日在多伦多去世，享年 83 岁。 贡献 编程语言 APL J ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/db29cb16/"},{"title":"图灵奖：艾伦·佩利（1966）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 2 期。 本文来自 wiki: Alan Perlis，翻译基于 DeepL. 颁奖词：因为他在高级编程技术和编译器构造领域的影响。 艾伦·佩利（1922年4月1日-1990年2月7日）是一位美国计算机科学家，曾任普渡大学、卡内基梅隆大学和耶鲁大学的教授。他因在编程语言方面的开创性工作而闻名，是图灵奖的第一位获得者。 佩利出生在宾夕法尼亚州匹兹堡的一个犹太家庭。他于 1939年 毕业于Taylor Allderdice 高中。1943年，他获得了卡内基技术学院（后来改名为卡内基梅隆大学）的化学学士学位。 二战期间，他在美国陆军服役，在那里他开始对数学感兴趣。随后，他在麻省理工学院（MIT）获得了数学硕士学位（1949 年）和博士学位（1950 年）。他的博士论文的题目是 “On Integral Equations, Their Solution by Iteration and Analytic Continuation”（论积分方程，它们的迭代和解析延拓解法）。 1952 年，他参加了“旋风计划”（Project Whirlwind）。他在普渡大学开始任教，并在 1956 年转到卡内基技术研究所。他是数学系主任，也是计算机科学系的首位负责人。1962 年，他被选为 ACM （国际计算机学会）主席。 佩利在 1966 年被授予首届图灵奖，颁奖词为“因为他在高级编程技术和编译器构建领域的影响”。这源于他在 1956 年所做的关于内部翻译器的工作（Donald Knuth 口中的第一个成功的编译器），以及作为开发编程语言 ALGOL 的团队的成员。 1971 年，佩利搬到耶鲁大学，担任计算机科学系主任，并担任 Eugene Higgins 主任美国。1977 年，他被选为国家工程院院士。 1982 年，他为计算机协会（ACM）的 SIGPLAN 杂志写了一篇文章，“关于编程的箴言”，用“箴言”的形式描述了他在职业生涯中所学到的许多关于编程的东西。后来一直在耶鲁大学工作，直到 1990 年去世。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/7d5031d5/"},{"title":"图灵奖：艾伦·纽厄尔（1975）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 11 期。 本文来自 wiki: Allen_Newell，翻译基于 腾讯交互翻译. 艾伦·纽厄尔（Allen Newell，1927年3月19日-1992年7月19日），美国计算机科学和认知心理学研究员，曾就职于 RAND 公司、卡内基梅隆大学计算机科学学院、Tepper 商学院和心理学系。 他是信息处理语言（IPL）发明者之一，并作为开发者之一，使用该语言编写最早的两个 AI 程序：逻辑理论家（Logic Theorist，首个可以自动进行推理的程序）和一般问题解决器（General Problem Solver）。 1975年他和赫伯特·西蒙（Herbert A. Simon，司马贺）一起因人工智能方面的基础贡献而被授予图灵奖。 其图灵奖颁奖词为“表彰其二十多年的联合科学努力中，最初与J. C. Shaw 在兰德公司，随后与众多师生在卡内基梅隆大学，纽厄尔和共同获奖者赫伯特·西蒙对人工智能、人类认知心理学和列表处理做出了基本贡献”（In joint scientific efforts extending over twenty years, initially in collaboration with J. C. Shaw at the RAND Corporation, and subsequentially with numerous faculty and student colleagues at Carnegie-Mellon University, Newell and co-recipient Herbert A. Simon made basic contributions to artificial intelligence, the psychology of human cognition, and list processing）。 生平纽厄尔于 1949 年在斯坦福大学获得物理学学士学位。 1949 年至 1950 年，他在普林斯顿大学读数学方向的研究生。由于他在研究数学的过程中接触了一个被称为博弈论的未知领域，从而确信他更喜欢实验和理论研究的结合学科而不是纯数学。 1950年，他离开普林斯顿，加入圣莫尼卡的兰德公司，在那里他为“一个研究空军后勤问题的小组（a group that was studying logistics problems of the Air Force）”工作（西蒙）。纽厄尔最终在现在的卡内基梅隆大学泰珀商学院获得博士学位，赫伯特·西蒙担任他的导师。 1954 年 9 月，纽厄尔参加了一个研讨会，奥利弗·塞尔福里奇（Oliver Selfridge）“描述了一个正在运行的计算机程序，该程序学会了识别字母和其他模式”（西蒙）。就在那时，艾伦开始相信系统可能是被创造出来的，智能，并具备自适应的能力。 他的工作引起了赫伯特·西蒙的注意，并与程序员 J. C. Shaw 一起开发了第一个真正的人工智能程序，逻辑理论家（Logic Theorist）。 他们在 1956 年的达特茅斯会议上介绍了该计划。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/7c572988/"},{"title":"图灵奖：艾兹赫尔·韦伯·迪杰斯特拉（1972）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 8 期。 本文来自 wiki: Edsger_Wybe_Dijkstra，翻译基于 腾讯交互翻译. 学过算法的，应该都不会忘记被最短路径（Dijkstra）算法支配的恐惧吧！ Edsger Wybe Dijkstra（1930 年 5 月 11 日- 2002 年 8 月 6 日）是一位荷兰计算机科学家、程序员、软件工程师、系统科学家和科学散文家。他因对开发结构化编程语言的基本贡献而获得 1972 年图灵奖。 其图灵奖颁奖词为“表彰对编程这一高智力挑战的基础性贡献；强有力的主张和切实地证明程序应该正确编写，而不仅仅是调试好；从程序设计的基础上阐明对问题的认识”（For fundamental contributions to programming as a high, intellectual challenge; for eloquent insistence and practical demonstration that programs should be composed correctly, not just debugged into correctness; for illuminating perception of problems at the foundations of program design）。 生平Edsger W. Dijkstra 1930 年出生于荷兰鹿特丹。他的父亲是一位化学家，曾任荷兰化学学会主席，曾在一所中学教化学，后来当了校长。他的母亲是一位数学家，但从未有过正式的工作。 Dijkstra 曾考虑从事法律职业，并希望在联合国代表荷兰。然而，1948 年毕业后，在他父母的建议下，他去往莱顿大学学习数学和物理，到后来的理论物理。 他的计算机生涯是很偶然的。读书期间，Dijkstra 通过他的导师，Johannes Haantjes 教授，他遇到了阿姆斯特丹数学中心计算部的主任Adriaan van Wijngaarden，并在得到了那里的一份工作。于是，在 1952 年 3 月，Dijkstra 正式成为了荷兰第一位“程序员”。 1959 年，他以题为“与自动计算机的通信”（Communication with an Automatic Computer）的论文获得了阿姆斯特丹大学的博士学位，论文描述了为荷兰开发的第一台商用计算机 Electrologica X1 设计的汇编语言。他的论文导师是 Van Wijngaarden。 2002 年 8 月 6 日，Dijkstra 在荷兰尼嫩（Nuenen）自己的家中与世长辞。终年72岁。 贡献 Dijkstra 最短路径算法 避免死锁产生的银行家算法 GOTO 陈述有害论 信号量 哲学家就餐问题 名言 一张图胜过一千个字，而一个公式胜过一千张图 “A picture may be worth a thousand words, a formula is worth a thousand pictures.” 关于没有参考条目这事，我既不解释也不道歉。 “For the absence of a bibliography I offer neither explanation nor apology.” - A Discipline of Programming (1976) 这怪不到麻省理工，毕竟他们没有注意到荷兰小镇上一位默默无闻的计算机科学家。 “You can hardly blame M.I.T. for not taking notice of an obscure computer scientist in a small town in the Netherlands.”~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/18d0e76/"},{"title":"图灵奖：莫里斯·威尔克斯（1967）","text":"图灵奖：莫里斯·威尔克斯（1967） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 3 期。 本文来自 wiki: Maurice Wilkes，翻译基于 DeepL. 莫里斯·文森特·威尔克斯爵士（Sir Maurice Vincent Wilkes FRS FREng）（1913年6月26日-2010年11月29日）是一位英国计算机科学家。他最为知名的工作是设计并制造了第一台具有内部存储程序的计算机，EDSAC。这台计算机建于 1949 年，是最早的存储程序计算机之一。他还发明了微编程，一种使用存储程序逻辑来操作中央处理单元电路的控制单元的方法。另外，他还与 Wheeler 和 Gill 一起在 1951 年编写了著名的《Preparation of Programs for Electronic Digital Computers》一书，该书引入了程序库。 威尔克斯与 EDSAC1945 年，威尔克斯被任命为剑桥大学数学实验室（后来的计算机实验室）的第二任主任。 剑桥的实验室最初有许多不同的计算设备，包括一台微分解析器。有一天，Leslie Comrie 拜访了威尔克斯，并借给他一份 John von Neumann 对EDVAC 的印前描述，这是 ENIAC 的正在建造的后继机。由于没有复印设备，威尔克斯就连夜阅读。这份文件描述了未来计算机的逻辑设计，这让他立即决定，参与这种机器的设计和建造。1946 年 8 月，威尔克斯乘船前往美国，参加摩尔学校的课程。但由于行程的延误，他只参与了最后两周的讲座。在返回英国的五天航程中，威尔克斯比较详细地勾画了一台机器的逻辑结构，而这就是后来的 EDSAC。 由于他的实验室有自己的资金，他一回到剑桥就立即开始了小型实用机器 EDSAC 的工作。他认为，他的任务不是去发明一个更好的计算机，而仅仅是为大学提供一个够用的。因此，他选择了实用的路线——只使用已被证实的方法来建造计算机的每个部分。由此诞生的计算机比其他当代计算机更慢更小。总之，他实验室的这台计算机是自 1949 年 5 月起、第二台成功运行的存储程序式电子计算机，比起规模更大、更复杂的 EDVAC 早了一年多。（根本区别在于前者的实用性） ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/1ab5d08/"},{"title":"图灵奖：詹姆斯·哈迪·威尔金森（1970）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 6 期。图灵奖：詹姆斯·哈迪·威尔金森（1970） 本文来自 wiki: James H. Wilkinson，翻译基于 腾讯交互翻译. 詹姆斯·哈迪·威尔金森（James Hardy Wilkinson，1919 年 9 月 27 日-1986 年 10 月 5 日）是一位英国数学家和计算机学家，他对所在的数值分析领域有杰出贡献（数值分析是应用数学与计算机科学的交叉学科，对物理学和工程有重要作用）。 由于他在促进高速数字计算机使用的数值分析方面的研究，并在线性代数计算和“向后”误差分析方面的工作得到了特别的认可，他 被授予 1970 年的图灵奖。 生平詹姆斯·哈迪·威尔金森 1919 年出生于英格兰的 Strood，在 16 岁时获得了剑桥大学三一学院的奖学金，并在 17 岁时开始学习数学。在 20 岁时，它以 Senior Wrangler 身份毕业。 二战期间，1940 年，他从事弹道学的研究。 在 1946 年，他转入国家物理实验室（NPL），并成为阿兰·图灵（Alan Turing）的同事，从事 Pilot ACE（英国最早的计算机之一）项目。并在图灵离开后实现了图灵的设想，完成了 ACE 原型。 往后，威尔金森在数值分析领域发现了许多重要的算法。 贡献 舍入误差 由于计算机使用精度有限的浮点数，因此在计算中会出现舍入误差，这可能会严重影响结果。威尔金森深入研究了此类舍入误差。这对于求解线性方程组特别重要。 Pilot ACE 著作 The Algebraic Eigenvalue Problem 最多被引用 Rounding Errors in Algebraic Processes Handbook for Computation, Volume II, Linear Algebra The Perfidious Polynomial. In: Studies in Numerical Analysis 彩蛋！稀疏矩阵，sparse matrix，这个术语就是他发明的。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/446c43db/"},{"title":"图灵奖：詹姆斯·尼古拉·格雷（1998）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 38 期。图灵奖：詹姆斯·尼古拉·格雷（1998） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Jim Gray，翻译基于 谷歌翻译. 詹姆斯·尼古拉·“吉姆”·格雷（James Nicholas “Jim” Gray，1944 年 1 月 12~2007 年 1 月 28 日？），美国计算机科学家。 他于 1998 年获得图灵奖。 其图灵奖颁奖词为“对数据库和事务处理研究的开创性贡献以及系统实施中的技术领导地位”。（For seminal contributions to database and transaction processing research and technical leadership in system implementation. ） 生平格雷 1944 年出生于旧金山。 1961 年，在被空军学院拒绝后，他进入了加州大学伯克利分校。为了支付大学费用，他在通用动力公司实习，在那里他学会了使用门罗计算器（Monroe calculator）。由于化学成绩很差，他待了 6 个月就离开了伯克利。 工作一段时间后他又回到了伯克利，并于 1966 年获得了工程数学（数学和统计学）学士学位。 而后他在贝尔实验室从事数字模拟工作，该模拟后来成为 Multics（分时多任务操作系统）的一部分。 在贝尔，他每周工作三天，并在纽约大学库朗研究所（New York University’s Courant Institute）攻读硕士学位两天。 后来，他又回到伯克利读研，师从迈克尔·A·哈里森（Michael A. Harrison），并于1969 年获得博士学位。然后在 IBM 进行了两年的博士后工作。 2007年，他独自航向法拉隆群岛，打算撒散母亲的骨灰，1月28日，他的船失踪了。2012年，他在法律意义上被认定已经死亡。 贡献格雷为多个主要数据库和事务处理系统做出了贡献。其中，IBM 的 System R 是 SQL 关系数据库的前身，该数据库已成为全世界的标准。 其他一些贡献包括： ACID，可靠事务处理及其软件实现 细粒度数据库锁 两层事务提交语义 分配存储的五分钟规则 用于数据仓库的 OLAP 立方体运算符 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/b3725f20/"},{"title":"图灵奖：费南多·柯巴托（1990）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 30 期。图灵奖：费南多·柯巴托（1990） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Fernando J. Corbató，翻译基于 谷歌翻译. 分时操作系统 费南多·荷西·柯巴托（Fernando José “Corby” Corbató，1926 年 7 月 1 日~ 2019 年 7 月 12 日），美国计算机科学家，是分时操作系统开发的先驱。 他于 1990 年获得图灵奖。 其图灵奖颁奖词为“表彰他组织概念并领导通用、大规模、分时和资源共享计算机系统 CTSS 和 Multics 开发的开创性工作”。（For his pioneering work organizing the concepts and leading the development of the general-purpose, large-scale, time-sharing and resource-sharing computer systems, CTSS and Multics.） 生平柯巴托 1926 年 7 月 1 日出生于加利福尼亚州奥克兰。 1943 年，柯巴托就读于加州大学洛杉矶分校，但由于第二次世界大战，他在第1年就被海军招募。 1946 年，柯巴托离开海军，就读于加州理工学院，并于 1950 年获得物理学学士学位。1956 年，他在麻省理工学院获得物理学博士学位。 毕业后，他立即加入麻省理工学院计算中心，1965年成为教授，并留在麻省理工学院直至退休。 柯巴托因糖尿病并发症于 2019 年 7 月 12 日在马萨诸塞州纽伯里波特去世，享年 93 岁。 分时操作系统与 Unix他所涉及的第一个分时系统被称为 MIT 兼容分时系统 (CTSS， Compatible Time-Sharing System)，它的早期版本在1961年被展示。 开发 CTSS 的经验催生了第二个项目 Multics，该项目被通用电气用于其高端计算机系统（后来被霍尼韦尔收购）。 Multics 开创了现代操作系统中使用的许多概念，包括分层文件系统、面向环的安全性、访问控制列表、单级存储、动态链接以及用于可靠服务的可扩展在线重新配置。 虽然 Multics 本身在商业上并不是特别成功，但它直接启发了 Ken Thompson 开发 Unix。 柯巴托定理（Corbató’s Law）：“在一段固定时间内，不管他使用的是什么编程语言，一个程式员能写作的源代码行数是固定的。” ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/4ab1d0bd/"},{"title":"图灵奖：赫伯特·西蒙（司马贺，1975）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 12 期。 本文来自 wiki: Herbert A. Simon，翻译基于 腾讯交互翻译. 赫伯特·亚历山大·西蒙（英语：Herbert Alexander Simon，1916年6月15日-2001年2月9日），美国政治学家。他的研究以其跨学科性质而闻名，跨越了认知科学，计算机科学，公共行政，管理和政治科学等领域。他的工作影响了计算机科学、经济学和认知心理学领域。 他的主要研究兴趣是组织内的决策，其中最著名的是“有限理性”（bounded rationality）和“满意”（satisficing）理论。 值得注意的是，西蒙是几个现代科学领域的先驱之一，如人工智能、信息处理、决策、问题解决、组织理论和复杂系统。他是最早分析复杂性结构并提出偏好连接机制来解释幂律分布的人之一。 他于 1978 年获得诺贝尔经济学奖，并于 1975 年获得图灵奖。 其图灵奖颁奖词为“在二十多年的联合科学努力中，最初与J. C. Shaw 在兰德公司，以及随后在卡内基梅隆大学的众多教师和学生同事中，西蒙和共同获奖者艾伦·纽韦尔对人工智能、人类认知心理学和列表处理做出了奠基性的贡献。”。（In joint scientific efforts extending over twenty years, initially in collaboration with J. C. Shaw at the RAND Corporation, and subsequentially with numerous faculty and student collegues at Carnegie-Mellon University, Simon and co-recipient Allen Newell made basic contributions to artificial intelligence, the psychology of human cognition, and list processing.） 生平赫伯特·亚历山大·西蒙 1916 年 6 月 15 日出生于威斯康星州密尔沃基。 西蒙就读于密尔沃基公立学校，在那里他对科学产生了兴趣。 1933年，西蒙进入芝加哥大学，并在他早期经历的影响下，决定学习社会科学和数学。（西蒙对研究生物学很感兴趣，但由于色盲的原因放弃） 在大学期间，西蒙专注于政治学和经济学。西蒙最重要的导师是 Henry Schultz，一位计量经济学家和数理经济学家。 西蒙分别于 1936 年和 1943 年获得了政治学的学士、博士学位。 在获得本科学位后，西蒙获得了市政管理的研究助理职位，并于1939年至 1942 年在加州大学伯克利分校担任运筹学研究小组的主任。 1942 年到 1949 年，西蒙是伊利诺伊理工学院的政治学教授，并担任系主任。 1949 年到 2001 年，西蒙担任卡内基梅隆大学的教员。 贡献 决策 基于西蒙的博士论文，《行政行为学》（Administrative Behavior），于 1947 年首次出版，并在多年中不断更新。 人工智能 西蒙是人工智能领域的先驱，他与 Allen Newell 一起创建了逻辑理论机（1956年）和通用问题求解器（GPS）（1957年）程序。 心理学 西蒙与 Edward Feigenbaum 一起开发了 EPAM（Elementary Perceiver and Memorizer）理论，这是第一个以计算机程序实现的学习理论之一。 社会学和经济学 西蒙是微观经济学的变革者，组织决策概念的提出者。他最先严格验证管理人员如何在没有完美和完整的信息时作出决定时。正是在这方面的工作，他于1978 年被授予诺贝尔奖。 教育学 西蒙的工作对 John Mighton 产生了很大的影响，后者开发了一个程序，在提高小学和高中学生的数学成绩方面取得了重大成功。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/3463527f/"},{"title":"图灵奖：达纳·斯科特（1976）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 14 期。 本文来自 wiki:Dana Scott，翻译基于 腾讯交互翻译. 达纳·斯图尔特·斯科特（英语：Dana Stewart Scott，1932 年 10 月 11 日-），美国逻辑学家，现为卡内基梅隆大学希尔曼大学计算机科学、哲学和数理逻辑名誉教授。 他在 20 世纪 70 年代与 Christopher Strachey 的合作奠定了现代编程语言语义方法的基础。同时，他还从事模态逻辑，拓扑学和范畴理论的研究。 因在自动机理论方面的工作，斯科特获得了 1976 年的图灵奖。 其图灵奖颁奖词为“与 Michael O. Rabin 联合撰写的论文“有限自动机及其决策问题”，其中介绍了非确定性机器的想法，这已被证明是一个非常有价值的概念。 他们的经典论文一直是该领域后续工作的持续灵感来源”。（Along with Michael O. Rabin, for their joint paper “Finite Automata and Their Decision Problem,” which introduced the idea of nondeterministic machines, which has proved to be an enormously valuable concept. Their (Scott &amp; Rabin) classic paper has been a continuous source of inspiration for subsequent work in this field） 生平1954 年，斯科特于加州大学伯克利分校的数学系获得了学士学位。 在普林斯顿大学，斯科特在 Alonzo Church 指导下，撰写了名为“收敛序列的完整理论”（Convergent Sequences of Complete Theories）的博士论文，并于 1958 年通过答辩。 完成博士学位后，他搬到了芝加哥大学，并在那里担任讲师到 1960 年。 1959 年，他与普林斯顿大学的同事 Michael O. Rabin，发表了题为“有限自动机和他们的决策问题”的论文，在自动机理论中引入了不确定性机器的概念。而这项工作使得二人被联合授予图灵奖。 贡献 自动机理论 笛卡尔幺半群 可计算函数逻辑 程序设计语言语义学 非确定有限自动机 …… （实在看不懂） ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/aeee1d1f/"},{"title":"图灵奖：迈克尔·奥瑟·拉宾（1976）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 13 期。 本文来自 wiki: Michael O. Rabin，翻译基于 腾讯交互翻译. 迈克尔·奥瑟·拉宾，出生于 1931 年 9 月 1 日，是以色列数学家、计算机科学家。 1976 年他和赫伯特·西蒙（Herbert A. Simon，司马贺）一起因人工智能方面的基础贡献而被授予图灵奖。 其图灵奖颁奖词为“与 Dana S. Scott 一起，他们联合发表了论文“有限自动机及其决策问题”，其中介绍了非确定性机器的想法，这已被证明是一个非常有价值的概念。 他们这篇经典论文一直是该领域后续工作的灵感来源”。（Along with Dana S. Scott, for their joint paper “Finite Automata and Their Decision Problem,” which introduced the idea of nondeterministic machines, which has proved to be an enormously valuable concept. Their (Scott &amp; Rabin) classic paper has been a continuous source of inspiration for subsequent work in this field.） 生平拉宾于 1931 年出生于德国 Breslau（今波兰 Wrocław）。 1935 年，他与家人移民到巴勒斯坦。 1948 年拉宾毕业于 Haifa 的希伯来雷亚里学校，并在 1948 年阿以战争期间应征入伍。 1949 年，由于在耶路撒冷担任数学教授的数学家亚伯拉罕·弗兰克尔（Abraham Fraenkel）的干预，拉宾退伍到大学学习。 拉宾于 1953 年获得耶路撒冷希伯来大学硕士学位，1956 年获得普林斯顿大学博士学位。 就职 Professor, Harvard (Gordon McKay Professor of Computer Science,1981-1983; Thomas J. Watson Sr. Professor of Computer Science 1983); Professor, Hebrew University of Jerusalem (Albert Einstein Chair,1980-1999; Pro-Rector, 1976-1980; Rector (Academic Head) 1972-1975; Chairman, Computer Science Department 1970-1971; Chairman, Institute of Mathematics 1964-1966; Senior Lecturer, Associate Professor and Professor 1958-1965); Institute for Advanced Study, Princeton (1958 Member; H. B. Fine Instructor1956-1958). 贡献 Rabin 密码系统 Rabin 指纹 Rabin 签名算法 Rabin–Karp 字符串搜索算法 不经意传输 非确定有限状态自动机 随机化算法 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/d5bd2347/"},{"title":"图灵奖：道格拉斯·恩格尔巴特（1997）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 37 期。图灵奖：道格拉斯·恩格尔巴特（1997） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Douglas Engelbart，翻译基于 谷歌翻译. 道格拉斯·卡尔·恩格尔巴特（Douglas Carl Engelbart，1925年1月30日－2013年7月2日）是一位美国工程师和发明家，也是早期计算机和互联网的先驱。 他最出名的是他在建立人机交互领域的工作，特别是在 SRI International 的增强研究中心实验室期间，该实验室创造了计算机鼠标，并开发了超文本、网络计算机和图形用户界面的前身。 这些在 1968 年的“The Mother of All Demos”上得到了演示。恩格尔巴特定律（即人类表现的内在速率呈指数增长的观察结果）以他的名字命名。 他于 1997 年获得图灵奖。 其图灵奖颁奖词为“为交互式计算的未来的鼓舞人心的愿景，以及帮助实现这一愿景的关键技术的发明”。（For an inspiring vision of the future of interactive computing and the invention of key technologies to help realize this vision. ） 生平恩格尔巴特于 1925 年 1 月 30 日出生于俄勒冈州波特兰。 在俄勒冈州立大学读本科期间，他在美国海军服役两年，在菲律宾担任无线电和雷达技术员。正是在那里，在偏远的莱特岛，在一座传统的高跷小屋里，他读到了万尼瓦尔·布什的文章《正如我们所想》（ “As We May Think”, Vannevar Bush ），这对他的思想和工作产生了很大的影响。 他返回俄勒冈州立大学并于 1948 年完成了电气工程学士学位。此后他受聘于艾姆斯研究中心的国家航空咨询委员会，从事风洞维护工作。 不久之后，恩格尔巴特离开艾姆斯前往加州大学伯克利分校攻读研究生。 在伯克利，他学习了电气工程，主修计算机，于 1953 年获得硕士学位，并于 1955 年获得博士学位。 鸡汤一则恩格尔巴特有一个“开窍”的过程：当时他订婚了，但是意识到除了“一份稳定的工作、结婚并从此过上幸福的生活”之外，他没有任何职业目标。他花了几个月时间思考： 他想让把自己的职业生涯集中在让世界变得更美好上 任何让世界变得更美好的结果都需要某种有计划的努力，这需要利用所有人的集体智慧以及有效的解决方案 如果你能显著改善我们的做法，你就能推动地球上解决重要问题的每一项努力——越快越好 计算机可以成为显著提高这种能力的工具 贡献 鼠标 超文本 协作软件 交互式计算，计算过程中交互 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/9ddd6d2d/"},{"title":"图灵奖：阿米尔·伯努利（1996）","text":"图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称。”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 36 期。图灵奖：阿米尔·伯努利（1996） 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 本文来自 wiki:Amir_Pnueli，翻译基于 谷歌翻译. 阿米尔·伯努利（Amir Pnueli，希伯来语：אמר פנואלй；1941年4月22日－2009年11月2日）是一位以色列计算机科学家。他在计算机科学领域的工作重点是时序逻辑和模型检查，特别是关于并发系统的公平性。 他于 1996 年获得图灵奖。 其图灵奖颁奖词为“表彰将时态逻辑引入计算科学的开创性工作以及对程序和系统验证的杰出贡献。”。（For seminal work introducing temporal logic into computing science and for outstanding contributions to program and system verification. ） 生平Pnueli 在以色列理工学院（Technion）获得数学学士学位，在魏茨曼科学研究所（Weizmann Institute of Science）获得应用数学博士学位（1967 年）。他的论文题目是“海洋潮汐的计算”。然后在斯坦福大学担任博士后期间转向计算机科学。 后来他回到以色列担任研究员。 他是特拉维夫大学计算机科学系的创始人和第一任系主任。 Pnueli 于 2009 年 11 月 2 日因脑溢血去世。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/ee068da1/"},{"title":"图灵奖：马文·闵斯基（1969）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 图灵奖是计算机界最负盛名的奖项，有“计算机界诺贝尔奖”之称，”图灵奖”系列将介绍历届获奖者。每周二更新，本文为第 5 期。 本文来自 wiki: Marvin Minsky，翻译基于 腾讯交互翻译. 马文·李·明斯基（英语：Marvin Lee Minsky，1927年8月9日-2016年1月24日）是一位美国认知和计算机科学家，MIT 人工智能实验室的联合创始人。 他因在创造、塑造、促进和推进人工智能（AI）领域方面的主导作用获得 1969 年的图灵奖。 生平马文·李·明斯基于 1927 年出生于纽约市的一个犹太人家庭。1950年，他大学毕业于哈佛大学数学系； 1954 年从普林斯顿大学数学系博士毕业。他的博士论文题目是“神经模拟强化系统理论及其在大脑模型问题上的应用”。 1954 年至 1957 年期间，他在哈佛大学研究员协会任初级研究员。而后，自 1958 年到他去世，他一直在麻省理工学院任教。 另外，他在 1958 年加入麻省理工学院林肯实验室的一年后，和约翰·麦卡锡（John McCarthy）开办了麻省理工学院计算机科学和人工智能实验室。 在计算机科学上的贡献 Artificial intelligence learning knowledge representation、 common sense reasoning computer vision robot manipulation cognitive psychology, neural networks, 第一个随机连线神经网络学习机, SNARC 书籍，《Perceptrons》 奠定了人工神经网络（ANN）的研究基础 automata theory, graphics and microscope technology. 首个头戴式图形显示器（1963） 共焦显微镜 1957，是当今广泛使用的共聚焦激光扫描显微镜的前身 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/c93fd99c/"},{"title":"数据可视化：开篇（1）","text":"数据可视化一直是一个有用却用常常被忽视的数据分析方法，本系列借助 gnuplot 或 Python 包介绍常见的图例展示方法。 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 上周四的文章介绍了平行坐标图（parallel coordinates plot），是我最近工作中很苦恼的一个问题的解答。 问题我突然意识到，“数据可视化”似乎是一个常常被泛统计学学科忽视的训练内容，包括我自己，可能也没有重视、系统性的学习这个范畴。这就导致，在遇见看似整洁的数据面前，脑海里没有浮现正确的数据展示方案，比如： 如何展示一组变量产生单一结果 $\\Rightarrow$ 平行坐标图 如何去展示大量“数据对”之间的差异？ 如何展示时间序列数据？ 甚至，如何正确的叫出某一类图例的学名，以高效的和同事交流。这些，都可能需要系统的学习“数据可视化”。 工具好马配好鞍。系统的学习不是纸上谈兵，高速发展的开源软件世界提供了边学边实践的可能：各种数据源、各种作图软件。 在“程序员+统计学者”的世界里，已经有了形形色色的作图工具。值得强调的是，无所不能的 C++ 标准库里缺少图形库，这使得使用 C++ 作图高效但笨拙。 此外，现有的一些工具常常被使用， Python Matplotlib、plotly、etc. Tool gnuplot、Octave、Excel、MATLAB C++ qwt (Qt) 上述常用工具除了斜体的,其余个人都能免费获取和使用。 思路接下来每周四，数据可视化系列将以 gnuplot 的功能为基础有序展开，并佐以每种图背后的统计学用途介绍，同时也将附赠 Python 代码。 最终，希望我们都能走向一个系统性学习的美好结局。 那就，下周四见~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/f7e80776/"},{"title":"数据可视化：统计量（2）","text":"数据可视化一直是一个有用却用常常被忽视的数据分析方法，本系列借助 gnuplot 或 Python 包介绍常见的图例展示方法。数据可视化：统计量（2） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 我们将从一些统计学相关的概念起步，以确保各位读者在基础知识方面有一个合格的起点。道理其实很简单——之所以使用“数据可视化”，那必然是因为从原始数据上很难发现差异或者规律，但我们至少要能知道如何在原始数据上进行研究。 所以，我们从“统计量”（statistic）起步。 插一句，英文的 statistic 这个术语有点拗口，它既可以表示用来计算统计量的函数，例如 do a statistic on something；也可以表示计算的结果，也就是这里的统计量。 1. 统计量统计量或抽样统计量是出于统计目的而根据样本中的值计算出得出的值。 这里说的统计目的包括： 估计总体参数 假设检验 1.1. 估计总体参数当统计量用于估计总体参数时，该统计量称为估计量。这种参数表征了总体的某种特性，但无法直接测量，而需要经过某种基于抽样的计算。 例如，样本均值是总体均值的无偏估计量。 注意，总体 vs 抽样 1.2. 假设检验统计假设检验(statistical hypothesis test)是一种统计推断(statistical inference)方法，用于确定数据是否充分支持某特定的假设。 这是检验统计量常见的使用场景，一些有名的此类统计量包括 $t$-统计量（$t$-检验）、$\\chi^2$-统计量（$\\chi^2$-检验）。 通过将检验统计量与临界值进行比较，或者等效地通过评估从检验统计量计算出的 p 值（$p$-value）来做出最终决策。 2. 常用统计量下面是一些常见的样本统计量，有些常用的会在后续的章节中介绍， 均值、中位数、众数 方差、标准差 分位数 检验统计量，如 $Z$、$t$、$\\chi^2$ 顺序统计量，如最大值、最小值 矩及其函数，如峰度、偏度 经验分布函数 参考资料 https://en.wikipedia.org/wiki/Statistic 😂完完完，讲起统计来，感觉半天回不去数据可视化的主题了，但这一部分又非常重要。比如，如果连分位数是啥都不知道，我来说这个 boxplot 的优点怕是空中楼阁了。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/8af7f0c7/"},{"title":"省馆之宝：内蒙古，草原宝藏","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 25 期。 本期介绍内蒙古博物院的镇馆藏品。本期选取了 6 件藏品。本期内容全部来自内蒙古博物院：官网，更多细节请访问相关网站。 匈奴王金冠·战国 尺寸：鹰高6.7，冠带直径16.5-16.8厘米，重1211.7克。 这套金冠饰的主体造型为，一展翅的雄鹰，站立在一个狼羊咬斗纹的半球状体上，俯瞰着大地。额圈由三条半圆形金条榫铆插合而成，上有浮雕卧虎、卧式盘角羊和卧马造型，中间部分为绳索纹。是目前国内发现唯一的匈奴贵族金冠饰。 神兽纹灰陶尊·新石器时代 口径19.1厘米、底径10.5厘米、高20.2厘米。 这件陶尊是有着赵宝沟文化特征的器物，器表和内壁都经过磨光处理，腹部压划神兽纹。神兽纹饰分布在陶器高度的1/3处，是视觉上“黄金分割点”的位置，分别是鹿、猪、鸟三种灵物，布局巧妙、制作精细、造型美观。 红山玉猪龙·5000多年前红山文化 这件玉猪龙玉器上雕刻的动物，鼻子突出褶皱，眼睛微凸、耳朵直立、身体卷曲、首尾相连、器体厚重、造型简素。这件玉器出土于赤峰市敖汉旗红山文化遗址，是红山文化中的代表性玉器。它体形较小，酷似玉玦，考古学界称之为“猪龙形玉玦”或玉猪龙。 鸟形双系彩陶罐·新石器时代 高37.2厘米、宽32.8厘米、底径11厘米。 鸟仰头张嘴，显示出嗷嗷待哺的形象。夹砂灰陶，表面绘红彩和黑彩的线条，使形象更加生动。这件器物整体做成鸟形，体现以鸟为图腾崇拜的现象。 龙首青铜灶·汉代 高44厘米、长40厘米。 器物为灶、烟筒、釜、甑分制组合而成。灶前有长方形灶门，后部插一昂首嘶吼的龙头烟筒，灶底有四蹄足，两侧各有一铺首衔环。灶是中原定居民族生活必需品，在内蒙古长城地带的汉墓中，多作为冥器出现。这件铜灶是内蒙古地区迄今发现个体最大最完整的一件。 和林格尔东汉墓壁画《幕府图》·东汉末年 全长约20米。 1971年，和林格尔的一位农民在修筑梯田时，发现了东汉时期的这座古墓。1972 至 1973 年间，内蒙古文物考古队对该墓葬进行了发掘与清理。在墓室的壁、顶及甬道两侧绘满了壁画，其画幅之大，内容之丰富，榜题之多，是我国考古发掘迄今所见汉墓壁画中最珍贵的样本。 墓主人名叫阚如。壁画和榜题宛如气韵生动的墓志铭，描绘出了墓主人瑰丽而完整的人生路径。在众多壁画中，《幕府图》描绘得最为详细，是墓葬画面的核心部分。整个幕府分为堂、营舍和庖舍3部分。营舍位于幕府后院，为幕府中管理军务的机构所在，庖舍位于幕府的西南角，掌管幕府厨饮之事。营舍位于幕府后院堂院为高大的庑殿式房屋，墓主人端坐堂上，堂下艺人在表演乐舞杂耍，身着民族服饰人物伏拜觐见，周围环立官吏武士，场面喧嚣隆重。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/d8c3cd5f/"},{"title":"省馆之宝：合集","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为最后一期，给出 28 个省（自治区）博物馆的链接合集。 本系列总计 28 期，介绍了 28 个省（自治区）的博物馆代表馆藏，可以作为一个观展指南。 你可以点击上面的标签，去到合集页直接查看。你也可以点击文末的“阅读原文”去备份站查看。 那么“省馆之宝”系列就到此结束了，谢谢各位读者的阅读。 ~~ 省馆之宝：辽宁，新中国建立的第一座博物馆 省馆之宝：山西，三晋大地 省馆之宝：河北，满城汉墓 省馆之宝：吉林，白山松水 省馆之宝：黑龙，黑土风采 省馆之宝：江苏，国立中央博物院 省馆之宝：浙江，越地长歌 省馆之宝：安徽，江淮撷珍 省馆之宝：福建，闽迹 省馆之宝：江西，江南青铜王国 省馆之宝：山东，齐鲁文博 省馆之宝：河南，九州腹地、十省通衢 省馆之宝：湖北，楚国八百年 省馆之宝：湖南，马王堆汉墓 省馆之宝：海南，天涯海角有古迹 省馆之宝：四川，春风又绿浣花溪 省馆之宝：贵州，苗舞侗歌 省馆之宝：云南，高原明珠 省馆之宝：陕西，十三朝古都 省馆之宝：甘肃，绿马很行 省馆之宝：青海，都兰遗珍 省馆之宝：台湾，故宫博物院 省馆之宝：新疆，好地方 省馆之宝：宁夏，西夏 省馆之宝：内蒙古，草原宝藏 省馆之宝：广西，歌舞之乡 省馆之宝：西藏，世界屋脊 省馆之宝：广东，不辞长作岭南人 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/41f3354d/"},{"title":"省馆之宝：宁夏，西夏","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 24 期。 本期介绍宁夏回族自治区博物馆的镇馆藏品。本期选取了 7 件藏品，其中，前 3 件为官网提到的三大镇馆之宝。本期内容全部来自宁夏回族自治区博物馆：官网，宁夏回族自治区文物考古研究所：官网和百度百科，更多细节请访问相关网站。 石刻胡旋舞墓门扇·唐 单扇：长89厘米，宽43厘米，厚5厘米；圆柱门枢：高13厘米，直径10厘米。 每扇门均呈长方形，上下有圆柱状榫，两门闭合处各有一孔，出土时有铁锁锁扣。每扇石门正中浅雕一“胡旋舞“男伎。所刻男伎为典型的胡人形象：虬髯卷发。深目高鼻，宽肩细腰，体魄健壮。身着圆领紧身窄袖衫，下着紧腿裙，脚穿长筒皮靴，站在一块编织精美的小圆毯上，双人对舞。左边舞伎侧身回首，左脚站立圆毯上，右腿后屈，左手正微微上举，右臂屈至头顶；右侧男伎右脚立毯上，左腿前伸，双臂上屈，至头顶上方合拢。 两人均手举长巾，熟练挥旋。四周剔地浅浮雕卷云纹，似舞伎腾跃于云气之中，造成流动如飞的艺术效果。整个画面构思精妙，主题突出，人物面部表情生动自然，体态轻盈健美，舞姿迅疾奔放、充满欢乐生活气息。 石雕力士志文支座·西夏 长68厘米，宽65厘米，高62厘米。 圆雕，白砂石质，近似正方体.圆雕男性人像，面部浑圆，颧骨高突，粗眉上翘，双目圆睁且外突，鼻梁短粗，撩牙外露，下额置于胸前，裸体，腹有肚兜，肩与头齐，肘部后屈，双手托膝，下肢屈跪，背部平直.座顶左上角阴刻西夏文三行，计15个字。第一布刊字，汉译为“小虫旷负”；第二行4字，汉译为“志文支座“；第三行7字，汉译为“瞻行通雕写流行”。背部阴刻汉文一行6字’‘砌垒匠高世昌‘，为西夏石雕工匠的姓名，弥足珍贵。雕像以夸张的手法表现了负重者的神态，反映出西夏时期石雕艺术的独特风格。迄今在西夏陵区多座帝陵的碑亭遗址中，共出土这类支座十多件，但刻有西夏文字的仅此一件.1996年，被定为国宝级文物。 鎏金铜牛·西夏 长120厘米，宽38厘米，高45厘米。 该文物由青铜铸造而成，中间空心，外表通体染金。牛屈肢而卧，牛角耸立，两耳竖起，双眸远眺，四肢有力，体态健壮，牛颈有弧纹，比例匀称，线条流畅，形象逼真，个体硕大。表现出了西夏时期较高的铸造工艺。1977年宁夏回族自治区银川市西夏陵陪葬墓出土。同年入藏宁夏博物馆。1996年被定为一级文物。 鎏金天王铜造像·西夏 高57.5厘米，正面宽31.7厘米，侧面宽16厘米。 佛教中的天王是护持佛法的神，该造像为四天王（亦称“四大金刚”）之一，取立姿，头戴宝冠，横眉怒目，长髯拂胸，身着金甲，下衬宽袖征袍，披带飘摇。左臂抬起，食指和小指向上，其余三指微屈，右臂内屈，右手握空拳（可能原握有兵器），足踏半马蹄形山岳台座。此像似为南方增长天王。在黑水城出土有一副西夏时期的增长天王画像，作赤色忿怒形，此形象在印度佛教中表示降伏邪魔、增长善根之意。相比之下，这件造像的整体形象则更加中原化。 彩绘泥塑佛头像·西夏 高39厘米、正面宽25厘米、 侧面宽27厘米。 这尊佛头像中空，头顶为螺髻。眼珠乌亮，为黑色釉料特制。下眼睑上有黑色泪痕。西夏出土的佛像大都是流泪的，这是由于环境变化，使佛像眼中的釉料融化，滴淌而出，从而形成佛像流泪的奇景。 德化窑观音立像·明 高36.2厘米，底宽11.5厘米。 明清时期德化窑曾大量烧造瓷塑释迎牟尼、观音、达摩、弥勒、妈祖、关帝、文昌等，涌现出何朝宗、张寿山、林朝景等能工巧匠。这除了与宫廷的佛事活动有关以外，也与明清时期德化窑所呈现出的非凡的制瓷实力有着密切关系。该器中空，观音身材修长，体态轻盈，容貌端庄，慈祥和蔼，超凡脱浴。头披羽巾，发髻高耸。头部稍向前倾，双目微合，若有所思，直鼻小口，两耳硕长，面庞丰满圆润。身着开襟长衫，胸前佩带缨路饰物，衣纹刻划很深，褶皱分明。观音左手搭于右手之上，惜有儿指残断；一脚露于衣物之外，立于海浪纹座土。此作瓷塑像通体施白釉，釉色滋润，以德化瓷细腻的质地和独特的象牙自展示其静美柔曼的风韵，朴素典雅，衣纹流畅，表情传神，形象逼真，美观大方。雕刻手法细腻，手、足、毫发之间尤见功力。 具装甲陶骑俑·北周 泥质灰陶，高17.7厘米，长17.2厘米。 骑俑头戴尖顶兜鍪（móu），中起脊棱，额前伸出冲角，两侧有护耳。身着铠甲，甲片长方形，以墨线勾勒。外罩黑色披风，两臂弯曲至胸前，双手作执物状，左拳心有孔，原物已失，战马垂首站立，身披鱼鳞状铠甲，辔（pèi）鞍齐备，四肢僵直粗壮，甲片用白色打底，墨线勾勒并点红色，周围涂朱。 南北朝时期，马铠已成为军规较为普遍的装备，而甲骑具装的普遍使用则使骑兵的攻击和防护能力得到了极大提高。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/4dab9a1/"},{"title":"省馆之宝：广东，不辞长作岭南人","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 28 期。 本期介绍广东省博物馆的镇馆藏品。本期选取了 8 件藏品，本期内容全部来自广东省博物馆：官网，更多细节请访问相关网站。 金漆木雕大神龛 根据大神龛龛门上金漆画的落款推断，它是1935年在“贻穀祠”内制作完成的。 这件神龛的两扇门由十二部分装饰而成，龛门正背面和龛内框栏、龛楣、楣栅，镂通雕人物故事、潮剧戏出、花鸟鱼虫、博古炉瓶等题材。龛后壁绘金漆画围屏，上部绘山水、人物和亭台楼阁等图案，下部绘仙鹤、喜鹊等祥禽瑞兽以及瓶花、香炉等图案。这些寓意着富贵吉祥、幸福喜庆的纹样，寄托了人们对美好生活的向往和追求。 潮州木雕是我国主要木雕流派之一，流行于粤东，以其极尽精致的雕刻和髹漆贴金的工艺而独具特色，具有金碧辉煌、富贵华丽的艺术效果。其起源至迟可追溯到唐宋时期，经过明代的发展，至清代达到鼎盛。潮州木雕应用广泛，涵盖建筑装饰、礼祭器具和家具陈设等方面，以宗祠家庙建筑装饰和祭祀用的礼器装饰最为大宗和精致。 潮汕人大多聚族而居，宗族观念极强，祠堂家庙成为崇宗敬祖的重要活动场所，每逢节日祭祀，必然祭拜祖宗，而神龛则是祠堂家庙必备的礼祭用具。它是潮汕民间供奉祖先神位的特制用具，整体造型庄重，制作精巧，是潮州木雕制品中做工最讲究的一种，以金漆木雕装饰最常见。潮汕人自古崇尚孝道，非常重视宗祠文化，把神龛做得精细辉煌，也是对骨肉亲情的一种重视。 宋金项饰 宋金项饰由四股八条金线编织而成，截面呈方形。带钩长条形，中间隆起并饰有花纹，其中一端有四个小圆环，可以用来调整松紧。作为南海I号沉船出水的第一件金器，宋金项饰承载着八百多年的历史。宋金项饰造型素雅，工艺精良，虽沉入沧海近千年，仍光彩夺目。它的工艺并非中国传统风格，暗示沉船或许与海外贸易活动有关。 南海 I 号是目前发现的较为完整的一艘宋代沉船，文物种类和数量都非常多。其中数量最多的是外销瓷器，占据目前出水文物的90% 左右，包含了景德镇窑、龙泉窑、德化窑等窑口的瓷器，样式形制各不相同，都是为海外市场定制。其他已发掘的文物还包括铜铁器、金银器、漆木器等等。宋金项饰在其中仅仅是一件普通文物，其他大量的金项链、金戒指等各类饰品都十分精美。经测量，这些金饰的含金量基本达到95%—98%。 清乾隆农耕商贸图外销壁纸 纵292.1 厘米，横72.4—146 厘米不等 中国壁纸是十八、十九世纪外销商品中的一种时髦饰品，以花鸟、风景、生产、生活等题材为主。“清乾隆农耕商贸图外销壁纸”来自英国英格兰东北部约克郡的一座一级历史保护建筑——夏活庄园大宅（Harewood House），是夏活伯爵拉斯切利斯家族（Lascelles Family）的收藏。据文献记载，亨利·拉斯切利斯是东印度公司商船“约克号”的船长，曾在1741-1748年三次乘“约克号”到访广州，这套壁纸就是亨利到访广州时的订购之物。该套壁纸共有12件，虽然每幅画面题材各不相同，但拼起来是一组完整的水乡稻作、茶叶贸易的广州风土人情写实画，既是当时外销壁纸中的佳作，也是清代早期中英商贸文化交流的重要历史见证。 赵孟頫《行书陋室铭》 纵49厘米、横131厘米，纸本。 赵孟頫（1254-1322），字子昂，号松雪道人、水晶宫道人等，浙江吴兴（今浙江湖州）人。宋宗室，入元后历官至翰林学士承旨，死后追封魏国公。其集诸艺于一身，诗文、道释、金石、音律无一不精，尤以书法和绘画成就最高，在书法史、绘画史上都占有重要地位。 此卷共19行，计86字，曾经国家文物鉴定委员会启功、徐邦达、刘九庵等先生鉴定为真迹。作品虽无纪年，但从印章、署款和书风看，应为赵氏早年作品。原为纸本挂轴，后经蓑衣裱，改为手卷。录书唐刘禹锡《陋室铭》全文，通篇结字扁平，用笔方圆并举，法度谨严，气势端秀，意态古朴生拙，与宋高宗书法在笔道、结体上多有继承之处，从中可以看出作者早年书风“初临思陵”“元贞以前，犹未脱高宗窠臼”的特点。 陈容《墨龙图》·南宋 纵201.5厘米，横130.5厘米 陈容，生卒不详，字公储，号所翁，一说是福建长乐人，也有说是江西临川人，《图绘宝鉴》作福唐（今福建福清）人。南宋端平二年（1235年）进士，曾官福建莆田太守。擅书画，长于松、竹、虎、鹤，尤精画龙，水墨纵横，气势豪壮，为中国写意龙画第一人。 此画无年款，署名所翁作。作品绢本墨笔，以水墨大写意表现独龙于云雾中腾驾，气势非凡。画中笔随形写，墨由状走，浓淡结合，局部见细节，整体见气神。作者运笔控墨得心应手，恰到好处，将龙之精神体貌表现无遗。该画为其代表作。 《群峰晴雪图》·北宋 纵114厘米，横48.2厘米 此画绢本，设色，落款处残缺，仅存“熙宁辛”三字，经考证，为熙宁辛亥年（公元1071年）所作。作品采用烘染、留白手法表现白雪皑皑的山间之景，全景式的构图增强画面之气势感，墨色擦染烘托山体雄浑与庄重，山间蟹爪枯树散布，茅亭楼阁半隐，迭迭山泉涌现，萧寒中平添一分趣味与变化，具有典型的宋代山水画风格。曾为谢稚柳、吴南生收藏，画面上方有谢稚柳题跋印鉴。 西周铜盉（ hé ） 该铜盉通高26.2厘米，造型别致、独特，形体凝重，纹饰繁复，刻缕精细。器身为“鬲”体，龙头型的壶嘴高高昂起，三足分立，扳手由两个缕空的夔龙精巧结合而成，盖体亦精制成凸起的龙头装饰，通体饰夔纹、雷纹和饕餮纹，其形制与纹饰均为均典型的西周器物。 千金猴王砚·清 长25.5、宽17.6、厚2.7厘米 老坑大西洞石。砚堂中有大片鱼脑冻，形似猕猴，侧蹲回首，栩栩如生。砚工因材施艺，将砚面及砚背巧妙设计为花果山、水帘洞意境。砚右侧铭文：千金猴王砚，光绪壬辰禺山何氏闲叟珍藏。砚左侧铭文：郭兰祥作砚，项信南刊字。 郭兰祥为肇庆制砚世家郭家传人，项信南为广州雕刻工匠。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/6e513fcf/"},{"title":"省馆之宝：广西，歌舞之乡","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 26 期。 本期介绍广西壮族自治区博物馆的镇馆藏品。本期选取了 4 件藏品。本期内容全部来自广西壮族自治区博物馆：官网，更多细节请访问相关网站。 翔鹭纹铜鼓·西汉 尺寸：高36.8厘米，面径56.4厘米，足径67.5厘米 鼓面中心为太阳纹，十二芒，芒外七晕圈，主晕为衔鱼翔鹭纹，其余饰栉纹、勾连雷纹和锯齿纹。鼓身九晕圈，饰锯齿纹、圆圈纹、羽人划船纹和羽人舞蹈纹。鼓胸为六组羽人划船纹，每船六人，其中三船的划船者皆戴羽冠，另三船各有一裸体人，船头下方有衔鱼站立的鹭鸶或花身水鸟，水中有游鱼。鼓腰饰八组羽人舞蹈纹，每组二至三人，头戴羽饰，下身系展开的羽裙，两臂外展，双腿叉开作舞蹈状。舞上空有衔鱼的翔鹭。足部一侧卧刻篆文“百廿斤”。铜鼓实测重30750克。 铜鼓是一种平面曲腰、中空无底的敲击体鸣乐器，流行于滇、黔、川、粤、桂、湘、琼等省区，使用于民族生活的不同领域。铜鼓由面、胸、腰、足、耳五部分组成。鼓面圆而平，是敲击发音的部分，下接鼓身，连接部分略外凸，形成球状弧度为胸。腰部略细，内收如束腰。往下鼓身又扩大，呈喇叭口部分为足。鼓身两侧各有两个半环形的耳。鼓面主体为太阳纹，周围有许多层称为“弦”的同心线条，弦数多少不等，弦与弦之间由宽窄不等的图案组成，称为晕圈。鼓身四周的表面，也有多数平行的晕圈，晕圈中铸出的纹饰图案绚丽多彩，有虫鱼、鸟兽、花卉、舟船和人物等。铜鼓制作工艺考究，用以铜为主要成分的铜、锡、铝合金等铸造而成。按不同形制和花纹，铜鼓可分为八个类型：万家坝型、石寨山型、冷水冲型、遵义型、麻江型、北流型、灵山型和西盟型。 该鼓属石寨山型铜鼓。铜鼓是西瓯、骆越的重器，瓯骆人不仅用作伴舞节乐，还曾把它作为权力和财富的象征。铜鼓集冶炼、铸造、绘画、雕塑、音乐、舞蹈于一身，是南方古代民族特有的综合艺术精品。铜鼓文化源远流长，融政治、经济、文化于一体，两千余年绵延不绝。直到今天，我们仍可在许多民族村寨领略到它的奇异风采。 漆绘提梁铜筒·西汉 尺寸：高41.8厘米，盖径13.8厘米，底径13厘米 此器为盛酒器。盖顶有环钮，深直腹，上部有一对铺首衔环耳，系活动提梁，圈足。同类器物在江苏、安徽、河北、辽宁、宁夏、山西、山东、陕西等地汉墓均有出土。其形状类似今广西壮族、苗族、瑶族人民外出劳动时随身携带用以盛水或装粥的竹筒。此器盖面绘勾连云纹，足部绘菱形纹。器身漆绘，上下共四段，每段均自成一个完整的画面。 第一段似二人观斗兽。画面右方绘一独角兽，面对一似虎之物。独角兽腾空而起，向前猛冲；虎，劲向前，右前肢抬起，迎上。画面中间有一朱雀。 第二段分为两组：一组绘两人围一朱雀及一兽对舞；另一组是一人荷矛牵犬前行，一人跪送。 第三段分为三组：第一组一人骑虎；第二组有三人，一人负长矛而立，一人腋下挟剑而跪，一老者策杖而行；第三组三人，以一高柄灯为中心，灯左方一人，侧身而立，似在言语，灯右侧二妇人，一前一后跪坐。 第四段分为三组：第一组是画面左方，一人在奋力搏兽；第二组二人位于画面中间，相跪而揖；第三组二人戴冠，着深衣相向而揖。 漆绘画面的内容，以上、下不同层次展开，这种表现方式正与长沙马王堆一号汉墓所出T行帛画相同。所画题材，造型生动，线条流畅，给人以惟妙惟肖之感。其中，人物的造型、服饰可在战国楚人绘画遗物中找到源头，并且，画面中两次出现的朱雀是楚人艺术创作中最为常用的母题之一。此外，画面的构图亦颇具匠心。故事的发生是以人物的行为动态提领情节，期间以流云、花木以及山岭补白，显得详略得当，浑然一体。作为一件难得的艺术品，此幅漆画是研究当时有关情况的重要实证。 人面纹羊角钮铜钟·西汉 尺寸：通高19厘米，纵径8.1厘米， 横径4厘米，底宽14厘米 钟呈半截橄榄形，上小下大，顶有羊角形扳钮，上端开长方形孔。鼓部正面铸有浮雕式的人面纹：人面呈桃子形，脸庞轮廓及眼、鼻、口突起，清晰显现；头顶一对倒八字形外撇的弯角，形若羊角；人面的两眼平视、双唇闭合，神态威严肃穆。合模铸成。 羊角钮钟流行于战国晚期至西汉初，是一种极富地方特色的青铜打击乐器。已知最早的羊角钮钟出土于云南楚雄万家坝的春秋晚期墓，但以岭南发现最多，如广西、广东、云南、贵州、湖南等省区及越南北部。在广西，除贵县外，浦北、西林、容县也有出土，形制大致相同。 与铜鼓一样，羊角钮钟作为古越人使用的重要的打击乐器，其在战国至汉代瓯骆文化遗迹——左江崖壁画中有描绘：在首领的带领下，伴随着敲击羊角钮钟、铜鼓等发出的节奏和音律，祭祀人群翩翩起舞。 经测音，此人面纹羊角钮铜钟正鼓音为#C5-27、侧鼓音为E5-4。音高、律制与同墓共出的“布”字铭钮铜钟、铜锣、铜鼓完全相同，可与这些乐器合奏本地特有的音乐旋律，广泛应用于各种祭祀等活动。 除了实用功能外，羊角钮钟还被赋予了作为权力和财富象征的社会功能。 马承源先生主编的《中国青铜器》指出，“人面纹是一种半人半兽的怪神，有的仅有面部，有得还有兽的身躯，面部虽为人形，但还包含兽类的特点，如头上长角，口中有獠牙”。装饰人面纹的器物，多是专用于祭祀活动的青铜礼器或巫术祭祀中的用品。装饰人面纹的羊角钮钟，被赋予了“天神”的威严和法力，占有它的人变为可以与天上神仙沟通、传递各种世俗愿望的“人神”。“通天达地”、“人神合一”，也是统治者用来显耀其权力和财富、神化自身以巩固其统治地位的工具。 羊是古越人所尊崇的图腾神之一。羊角钮钟上的人面头顶饰有一对外撇的羊角，应是古越人对羊图腾崇拜的体现。 羽纹铜凤灯·西汉 尺寸：通高33厘米，长42厘米，宽15厘米 灯作凤鸟形，顾首回望，双足分立，尾羽下垂及地。足与尾形成鼎立之势以支撑灯身。头、冠、颈、翅、尾、足各部位轮廓清晰，比例匀称。通体细刻羽毛，精致美观。凤鸟背部有一圆孔，用以放置长柄灯盏。凤鸟口内衔喇叭形灯罩，垂直对准灯盏蜡锥柱上方。凤鸟颈部由两段套管衔接，可以自由转动和拆卸，便于调节灯光和冲洗体内烟尘。灯罩与颈部及腹腔相通，腹腔中空，可以贮水。当灯盏中的蜡烛点燃时，烟灰经灯罩纳入颈管，再由颈管导入腹腔，最后溶入水中。 此羽纹铜凤灯具有三个特点。 一是造型独特。该灯凤鸟造型，灵巧优美、活泼可爱，寓意吉祥，富于浓郁的生活气息。 二是工艺先进。该灯的铸造采用了汉代分铸法；纹饰采用西汉时期流行于我国南方，特别是岭南地区的一种新兴錾刻花纹工艺。 三是构思巧妙。在油灯上加装导烟管，将环保思想应用于灯具的设计制作中，是汉代首创，在世界灯具史上也处于领先地位。类似功能的汉代灯具不断被考古发掘，如河北出土的长信宫灯、山西出土的彩绘雁鱼铜灯等，说明利用清水净化烟尘的科学思想在西汉时期受到人们的普遍重视。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/cbf71fb5/"},{"title":"省馆之宝：西藏，世界屋脊","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 通常，一个省级行政区内最有名的文物都会被收藏到其省博物馆内。所以，”省馆之宝”系列将介绍我国各个省馆的明星文物。每周二更新，本文为第 27 期。 本期介绍西藏博物馆的镇馆藏品。本期选取了 6 件藏品，其中第一件为禁止出国(境)展览文物。本期内容全部来自西藏博物馆：官网，更多细节请访问相关网站。 元“统领释教大元国师之印”龙钮玉印 长12.2厘米，宽12.2厘米，高12厘米。玉质青色。扁方形，龙钮。印文为八思巴文，内容是“统领释教大元国师”的藏文译音。整器雕琢而成，造型庄重古朴，是典型的元代官方重器。 说唱帽 说唱格萨尔时需要佩戴说唱帽，展柜中展示的这件就是西藏已故著名艺术家土登先生捐赠给西藏博物馆的，旁边的书籍详细记录了帽子上的每个饰物所代表的寓意。在西藏，目前规模盛大、影响广泛的三大赛马节要属那曲恰青赛马节、当吉仁赛马节、江孜达玛节。除了赛马、骑马射箭、骑马拾哈达等活动外，还有会举行摔跤、抱石头、拔河等竞技比赛，使节日氛围更加热烈。 嘎乌 嘎乌为藏语音译，即佛盒。人们将护法神、印着经文的布片、纸片或舍利子等放入盒中，佩戴在身上以求平安。随着经济社会的发展，嘎乌的材质和工艺也愈加考究，功能也日益朝着装饰的方向发展。女性佩戴的嘎乌以金、银、铜等材质居多，形状有圆、椭圆、星形等，表面雕刻多种吉祥图案，并镶嵌玛瑙、绿松石、珊瑚等宝石，佩戴于胸前。男性的嘎乌则一般为方形，且器形较大，金属表面镶嵌物较少，一般斜挂于左腋与左臂之间。 角质酒壶 西藏人民饮酒一般使用木碗，讲究的人家会将质地优良的木碗用纯银包裹，并镶嵌宝石。由于角质用具易于携带，且硬度大不易破损，因此，游牧地区角质酒壶较为普遍。“匝阔”是代表性的农区酒具，“匝”是陶的意思，从名称可以看出，这种酒具最初是陶制品，目前看到的多为铜质，在日喀则等传统农耕地区，是盛行。婚礼或者新年等重要庆典上使用的一种酒具。 皮质糌粑袋 糌粑是西藏人民的一种主食，食用时所使用的器具有传统的木质糌粑盖碗、瓷碗、羊皮糌粑袋等。把糌粑倒入羊皮袋中，再倒入适量茶水、酸奶或青稞酒后用力揉搓成块状便可食用，这种用具一般在外放牧或者田间劳作时使用，最大的特点是便于携带，干净卫生。 佛教造像·不空成就佛 在持续受到祖国其他地区以及印度、尼泊尔、克什米尔等地佛教造像艺术的影响下，结合西藏各时期各地不同的政治、文化、经济面貌，西藏地区佛造像艺术逐渐形成不同地方特色。这里陈列的这些精美佛教造像，就是按照元明时期典型的本地风格流派进行分类的，大家首先看到的这件不空成就佛，即为丹萨替风格造像。丹萨梯塑佛像一般具有脸型宽大，面部饱满，装饰繁缛等的特点，现存世量极少。 双体陶罐 开始制作陶器也是进入新石器时代的特征。卡若陶器的制作手法为手制，所以器形不规整，类别比较简单。随着时代的发展与进步，人们很快就掌握了泥条盘筑和轮制法，卡若先民的制陶技术才得到一定发展，能够制造出更加精美的陶器。这件陶器是我馆的镇馆之宝—-双体陶罐，形体好像两只小兽相向而立，颈部和肩部设计了一对带孔钮，既巧妙地表现出动物的耳与尾，还为方便携带而穿绳之用。此件双体陶罐无论从器形还是纹饰，都体现出与同时期出土的陶器与众不同的特点，不仅代表了当时卡若文化的最高制陶水平，而且体现出了卡若先民高超的器物造型能力，是新石器时代西藏陶器的代表和点睛之作，初步认为，这件陶罐是卡若先民在庆典和祭祀活动中使用的一种礼器。 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/b332288e/"},{"title":"科技：实力硬刚OpenAI，马斯克将Grok-1开源","text":"i&gt; 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。科技：实力硬刚OpenAI，马斯克将Grok-1开源 刚刚，马斯克旗下 AI 部门 xAI 正式将其大语言模型 Grok-1 开源，这意味着模型的权重和网络架构都被公开使用。 顺带继续嘲讽了一把 OpenAI， Musk Grok-1Grok-1 是由 xAI 从头开始训练的 314B （3140亿）参数的混合专家模型（MoE，mix-of-experts）。 发布的是 Grok-1 预训练阶段、在 2023 年 10 月的基模型 checkpoint。这意味着该模型没有针对任何特定的应用程序(例如对话)进行微调（fine-tuning）。 这一把算是真开源，因为权重和架构采用的是Apache 2.0这种宽松许可。 具体可以去 GitHub:xai-org/grok-1 上观摩，不过一般人应该是没这个硬件玩起来了。因为 314B 就意味着至少得有 600 多个 GB 的运存（最次也的是内存）才能跑起来。请按照github.com/xai-org/grok上的说明进行操作。 一些细节根据 xAI 官网披露，开源的模型有以下几个特点， 在大量文本数据上训练的基础模型，没有针对任何特定任务进行微调。 314B 参数 MoE 模型，对于每个正在处理的令牌（token），实际调用的参数是总量的 25% 2023 年 10 月，xAI 使用 JAX 和 Rust 语言从头开始训练 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu/posts/a672dd0a/"},{"title":"荐歌：危险派对（王以太）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：危险派对（王以太） 终于，周五了。 这周上了六天班，就加了五天大班，人都麻了，现在看东西都是有点花。 “充实”的工作需要音乐来调节，而这周主要受诺米影响，又回去听了很多 rap。 我最喜欢的类似音乐风格其实是所谓的 Melody Rap，也就是“旋律说唱”，比如诺米《阿普的思念》这种也算是。就不是那种劈里啪啦一阵文字输出的节奏型说唱。 那这种音乐类型就不得不提到王以太了。 所以今天推荐王以太在抖音世界里很火的这首《危险派对》。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354你的光芒闪耀像是gold逐渐入侵了我眼眸到底要怎么样的口吻才能让你内心点头是我猜不透你的味觉是我察觉不到的危险别把离开挂在嘴边当你慢慢靠近我是我没把握你心跳的节奏换来一堆轻佻的借口别成为我心碎的理由Don’t hurt me babyDon’t hurt me告诉我你现在的感觉你的眼神都那么明显别把结果拖延到明天Maybe we just slow downAnyone but you's so wrong当音乐再次奏响连呼吸都在碰撞把心放你手掌沦陷在你目光享受着步调摇晃舞会开场左手保护你的腰从不会碰到你的背右手托住你的心跳不论向前或后退如果你很信任我手抬高原地转个圈烦恼都丢掉像幻灯片当我们站在舞台的正中间如果我们的热情依然在增加自然跳起象征着爱情的伦巴一起跳到下一个晚宴到星星布满天把飞逝的时间给扔下已然忘记美好的今天要拍照片不知不觉就已送你到楼下目前这些美好的幻想还没套现希望你的回答可以让我留下Maybe we just slow downAnyone but you's so wrong当音乐再次奏响连呼吸都在碰撞把心放你手掌沦陷在你目光享受着步调摇晃我不危险 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/d5ff4c37/"},{"title":"荐歌：哈尼宝贝（南征北战NZBZ）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：哈尼宝贝（南征北战NZBZ） 周末愉快！ 好消息，放假了；坏消息，就放一天。 春节长假前的这一周总是很浮躁的啊！反正我是不怎么坐的住了。 今天偶然又听到了南征北战组合的这首《哈尼宝贝》，没记错的话应该是《唐人街探案》的主题曲之一？但其实今天我才反应过来这首歌的小心思。 哈尼族是一支少数民族，这首歌的听不懂的、好听的少数民族语言部分就是哈尼族的民歌，不过这首歌由米线（女歌手）对原曲进行了加速演唱。歌名《哈尼宝贝》也是一语双关哈尼族和honey。 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253&lt;哈尼族民歌&gt;Hey beautiful girl听我唱首情歌Your wonderful show把我爱唤醒了My honey honeyMy baby babyHey beautiful girl听我唱首情歌Your wonderful show把我爱唤醒了My honey honeyMy baby babyBaby girl you're my pretty girl你美丽散发魅力Really really pretty girl喜欢你的微笑歌声的美妙你是My 哈尼 baby请你大胆跟我手牵手让我带你 com'on 往前走这是 beautiful lifeYou're my beautiful girlMy 哈尼 babyHey beautiful girlYour wonderful showMy honey honeyMy baby babyHey beautiful girlYour wonderful showMy honey honeyMy baby babyHey beautiful girl听我唱首情歌Your wonderful show把我爱唤醒了My honey honeyMy baby babyHey beautiful girl听我唱首情歌Your wonderful show把我爱唤醒了My honey honeyMy 哈尼 babyMy 哈尼 babyMy 哈尼 babyMy 哈尼 babyMy 哈尼 babyMy 哈尼 baby ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/133775db/"},{"title":"荐歌：夏天（李玖哲）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：夏天（李玖哲） 五一“伪”小长假过半，各位玩的都还开心吗？ 这首来自李玖哲的抖音神曲《夏天》无需多言，副歌响起的时候，自然会跟着一起在浪漫氛围里环游。值得一提的是，此歌的作曲是周杰伦。 夏天的确是充满了青春的气息，让人充满了对生活的热爱和激情。在这个季节里，我们都经历许多令人难忘的瞬间，比如高考、比如毕业分别，又比如与朋友们一起畅游在海边、在星空下与心爱的人共度浪漫时光，都会让人感到幸福和感动。 夏天的炎热也让人更加珍惜清凉的时刻，每一次微风拂过，都是一种享受。正是这些瞬间让夏天变得如此美好。 12345678910111213141516171819202122232425262728293031323334353637383940414243春雨后太阳缓缓的露出笑容你的微笑就像弯弯的彩虹在这片天空云朵就是我随时随地环绕在你四周河堤上的风筝拉长自由微风慢慢吹着幸福感动我也想紧紧握紧紧牵你的手浪漫的抱着你看着日落怕黑时候数着指头时间就会很快过我会小心呵护守候下雨有我肩膀靠睡不着记得想着我三秒后会梦见我载着气球陪你兜风看遍所有会笑的星空整个夏天想和你环游世界山路蜿蜒就像是爱的冒险你的笑脸是我唯一的零嘴我用双眼捕捉这特写整个夏天融化了整个季节一天一天把你定格在结尾让我了解爱原来可以那么简单点缀看窗外的蓝天在这个屋檐我回忆画面有你情节整个夏天想和你环游世界山路蜿蜒就像是爱的冒险你的笑脸是我唯一的零嘴我用双眼捕捉这特写整个夏天融化了整个季节一天一天把你定格在结尾让我了解爱原来可以那么简单点缀看窗外的蓝天在这个屋檐我回忆画面有你情节 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/cc225451/"},{"title":"荐歌：宿敌（许嵩）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：宿敌（许嵩） 周末愉快！ 相比往日，今天回家的路格外顺畅，不知道为什么。 最近看着歌词听了许嵩的《宿敌》。这首歌保持着许嵩的一贯创作水准，优雅、好听。但歌词是真的复杂啊！以前光听没觉着，看着歌词的时候好像一首完全陌生的歌一样。 许嵩的歌历久弥香，时听时新，舒坦！ 12345678910111213141516171819202122232425会在何处见到你，莫非前尘已注定飞过时空的距离，却囿于刀剑光影三月春花渐次醒，迢迢年华谁老去是劫是缘随我心，除了你万敌不侵当恩怨各一半，我怎么圈揽看灯笼血红染，寻仇已太晚月下门童喟叹，昨夜太平长安当天上星河转，我命已定盘待绝笔墨痕干，宿敌已来犯我借你的孤单，今生恐怕难还缠扰孤岛的雪雨，飘飘洒洒谁来停摘取一颗海上星，陪我终夜不孤寂灵柩长埋深谷底，没有永远的秘密染指江湖结悲局，无人逃得过宿命当恩怨各一半，我怎么圈揽看灯笼血红染，寻仇已太晚月下门童喟叹，昨夜太平长安当天上星河转，我命已定盘待绝笔墨痕干，宿敌已来犯我借你的孤单，今生恐怕难还 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/98b7b6ed/"},{"title":"荐歌：明天你依旧在我身旁（声音玩具）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。 *都看到这儿了，不如关注每日推送的“科文路”、互动起来~&gt; 文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：明天你依旧在我身旁（声音玩具） 周末愉快！ 去年今日，是我离开上一家公司的时间。上了一年班，加班如日常，最后想把 10 天未用年假中的 5 天请了。公司居然不同意。。。于是，接下来这一周就被我定成了年假周。今后凡是有条件，我这一周就休年假了。 今天推荐声音玩具的《明天你依旧在我身旁》。 这首歌可以说是我的摇滚启蒙之一了，听到这首歌的旋律就回到了大学时期的幻境。青春啊！永远不会像为人牛马那般无助。 1234567891011121314151617181920212223242526272829作词 : 欧珈源作曲 : 欧珈源我们围坐在石头砌成的火塘边看月色如何映红你的脸哪儿还有一路的艰难轻装这一路潜行远离灯火阑珊处的人群听马蹄奋起回声的山谷里细诉往事一如散落的群星只有一件事最重要的明天你依旧宇宙的无理性偶然呈现在你触动夏天的指尖穿越过工业区穿越过梯田相遇在漫长雪道的另一面回望身后片刻的永恒像鸟一样在天空深处恋爱和自由迁徙的飞翔栖息在最无边的土壤只有一件事最重要的明天你依旧在我身旁时空飞逝年华老去我们也许无力前行但是你我都能知道那是唯一的方向只有一件事最重要的明天你依旧 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~*","link":"/kewenlu/posts/f25ff787/"},{"title":"荐歌：没那种命（陈小春）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：没那种命（陈小春） 周末愉快！ 工作恢复了年前的状态和节奏，一切都正常啦！气温看起来也是就要开始往上走了，春天可能要登场了。 今天开始，新赛季的中超联赛也开始了，作为一个球迷，看球的日子也要开始啦。不管中国足球成绩多差，我还是建议大家走进赛场看看，还是很有意思的。不管中超还是中冠，球员们互相较劲，球迷们欢声雷动，这个场面值得一觑。 这两天成都阴雨绵绵，我听起了陈小春的歌，这首《没那种命》陪伴了多少盆友度过无助的青葱岁月呢。 12345678910111213141516171819202122232425作词 : 易家扬作曲 : 包小柏爱情这东西 没道理的有人很抢手 有人没资格路是人走的 我害怕什么大不了 别爱了她像个天仙 她太美了我那么平凡 我开不了口心里面晓得 追她的结果幸运的 不是我唉我没那种命呀 她没道理爱上我英雄和美人呐 是一国的只怪 爱人太少了 对手太好了劝自己别傻了以前甭提了 以后非加油不可我没那种命呀 轮也不会轮到我爱情老是缺货 我争什么时间 越来越少了 越来越老了我剩下一个梦她走过来说 其实我错了 她爱我 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/82dfb9a3/"},{"title":"荐歌：深夜书店（许嵩、洛天依）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：深夜书店（许嵩、洛天依） 周末愉快！ 这周过的真快，下周又只有三天，感觉好多事没做啊！ 最近一直听许嵩的歌，总体讲都是百听不厌的。有天就随即切换到了这首《深夜书店》，合唱的这个洛天依是一个虚拟人物的虚拟声音。很神奇的感觉。 可以试听一下。 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273747576777879已经是星期六的晚上零点朋友来电约我去逛逛书店我困呆了 但我的致命缺点就是不爱拒绝戴了个帽子就出门 吹头发太费时间推开店门我看见一座不夜书城灯火通明里散落着有缘的年轻人那老兄在不远处向我挥了挥手我点头示意之后就自顾自转悠转悠 无聊的心情忽然转优前排书架前有半张侧脸好清秀她轻咬嘴唇 读书那么投入我瞄了一眼 她好像在看宇宙学科普读物霍金为你写出时间简史我愿为你写出一首小诗飘到你的身边佯装没事心猿意马 拿起本书 翻了两下 欲言又止你看书还是看我眼神里求知欲多心里燃起了焰火想说什么就勇敢说你看书还是看我眼神里求知欲多心里燃起了焰火想说什么就勇敢说夜…夜…夜…夜…夜深夜…夜…夜…夜…夜时间滴滴嗒嗒嗒嗒嗒嗒我想搭搭搭搭搭搭搭话但有一种莫名的包袱缠身会不会有辱斯文 像不像轻浮的人你轻盈从身边走过香风缭绕这条裙子显出你身姿的曼妙有没有CD书店二层有卖CD你踏上电动扶梯我紧跟了上去你听着音乐不经意地莞尔一笑我的神魂顿时比宁采臣还要颠倒神农尝百草 别问饱不饱你对我的单身症好像有奇效落地窗外的夜色引人想入非非什么是非非 心已经飞飞你是中心 我是圆规那条勤劳的腿三百六十度 落在你周围 静静的看着你无死角的美你看书还是看我眼神里求知欲多心里燃起了焰火想说什么就勇敢说你看书还是看我眼神里求知欲多心里燃起了焰火想说什么就勇敢说夜…夜…夜…夜…夜深夜…夜…夜…夜…夜就在这时你走向收银柜台排队买单你今夜买的每本书我也都得买回家看心里想的是好好研究一下你的口味可眼前的问题是没留联系方式该怎么办怎么办怎么办怎么办怎么办真的要完蛋 眼看你付完款把书装进包里 向门外快步走去我终于下定决心大步流星追了出去当我踏出店门 街道上空气清新我深吸了一口气 这深夜刚下过雨你已不知踪影 小小的懊悔之余还是很感谢你 生活里需要美丽 需要惊喜有时间还要再来多买多买一些书籍书中搞不好没有黄金屋 千钟粟 颜如玉可书店 有你啊有你 有你有你 你是美好地有你 你是美好地有你 你是美好地有你 你是美好地有你 你是美好地有你 你是美好地 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/834db9c0/"},{"title":"荐歌：男孩别哭（海龟先生）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：男孩别哭（海龟先生） 周末愉快！ 快过年了啊，来一首轻快的歌吧——海龟先生的《男孩别哭》。 这首歌居然已经是 2012 年的歌啦，不过这首歌的慵懒感太适合现在的“躺平”文化氛围了。 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657我跟你描述一个灵魂它拥有不谢的青春每当夜色降临就会轻轻歌唱它唱着一个新鲜的故事里面的人们相互微笑是不是每个夜晚都要这样为了爱去用清醒交换男孩别哭美丽世界的孤儿可我的心我的家在哪里在哪里呢我的朋友静静地听有个声音在说爱你闭上眼跟随她跟随她 就像跟着希望那些城市上空飘着一颗颗不安的心她一定也曾在这儿跳过欢快的舞蹈清风吹来让我感到一阵迷醉那婆娑的身影太阳般光洁那些男孩一次次地叫着寂寞妈妈爱是否能抚平他们内心的内心的伤痕孤独的人呐我带上你走boy boy boy isolationbye bye bye bye bye a one night standDance dance in nowhereDon't don't don't don't don't be afraid againboy boy boy isolationbye bye bye bye bye a one night standDance dance in nowhereDon't don't don't don't you don't don't don't be afraid这是一个放肆狂妄的年代我们的身体怎能时刻拥抱在一起去见证这样的爱情早已筋疲力尽你脸上尽管挂着深深的泪痕我的心 我的爱还是跟着梦想远走去寻找另一个生命它会带上我走boy boy boy isolationbye bye bye bye bye a one night standDance dance in nowhereDon't don't don't don't don't be afraid againboy boy boy isolationbye bye bye bye bye a one night standDance dance in nowhereDon't don't don't don't you don't don't don't be afraid ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/741a76b5/"},{"title":"荐歌：阿普的思念（诺米）","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。荐歌：阿普的思念（诺米） 又是周五了，这周结结实实的被一个 rapper 给耍了。是的，就是凭一己之力让成都拥有了“迪士尼”的诺米。 起因是诺米参加《中国新说唱》被导师谢帝给淘汰了，然后心生怨恨，写了一首说唱，其中比较洗脑和诙谐的就是那句“谢帝、谢帝、我要diss你”。慢慢的，就被网友们玩成了，“谢帝、谢帝、我要迪士尼”。 于是，成都一夜之间就拥有了诺米MV中的同款打卡圣地——玉林“迪士尼”。更引得无数人争相前往打卡。 就这，一开始我和大多数网友的心情一样，就觉得诺米这人确实太水了，一首diss说唱也写的像儿歌。直到刚刚，诺米的代表作《阿普的思念》走红，于是包括我在内的广大网友瞬间感受到了欺骗😂 这歌且不说多牛，但至少说明这哥们儿真会啊~一起来听听凉山底层rapper对爷爷的思念吧！ 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566把那牛和羊群放在那片山坡上好久不见阿普你是否别来无恙还是那副老面孔啊慈祥的模样你说我现在做的东西是不是叫说唱把那牛和羊群放在那片山坡上好久不见阿普你是否别来无恙还是那副老面孔啊慈祥的模样你说我现在做的东西是不是叫说唱ꀄꊭꃅꄮꉢꅉꀋꐚ小时候不懂事ꀊꃆꋋꄮꆏꉉꌌꉠꉌꃀꌸ到这个年纪我的心才被你的语言给打动ꆏꉉꇬꃰꊿꋋꑶꆹ你说人活在这世上ꏾꀕꃅꀑꁧꏭꉜꄉꆀꐥ努力的活着不能停留在原地ꀊꄶꁬꎬꃴꇈꀕꂷꌠ在那片绿油油的草地ꃀꀕꋃꆥꆏꑣꉢꄎꋻ你总会给我摘一瓶子的野莓ꎭꋻꂮꋻꀉꁌꆀꃅꐦꇬꊿ冷过饿过在我心中我的爷爷是这世上的伟人ꑵ…ꀑ…ꑵ,ꑵꉙꋋꎴꑵ唱～唱 唱一首动听的歌ꑵꉙꋋꎴꑵꆏꇰꇬꆏꆹꆏꈧꀕꀑ唱我给你写的这首歌你能否会听得到吗ꑵ…ꀑ…ꑵ,ꑵꉙꋋꎴꑵ唱～唱 我还要再去唱一遍ꑵꉙꋋꎴꑵꆏꇰꇬꆏꆹꆏꈧꀕ唱这一首歌我也知道你不会再听见了把那牛和羊群放在那片山坡上好久不见阿普你是否别来无恙还是那副老面孔啊慈祥的模样你说我现在做的东西是不是叫说唱把那牛和羊群放在那片山坡上好久不见阿普你是否别来无恙还是那副老面孔啊慈祥的模样你说我现在做的东西是不是叫说唱还记得小时候过年我们把彝家美酒端起还记得我上个幼儿园你都要为我找关系还记的您总是不舍得孵的鸡蛋为我煎起一切的一切啊您是否还会在那山里ꊰꊪꈎꊰꑋꈎ十一岁 十二岁ꆏꀊꁌꁮꅉꌧꉡꇰ你给我讲着童话故事ꊿꐈꀉꂵꆀꀉꁌꇗꅉ老巫婆不同脸色的故事ꌳꃅꌲꈄꈧꌠꆀꀊꇗꀑ……支格阿卢的英雄事迹高山的鸟儿在唱着我的歌高山的雄鹰带着阿普的梦那一道道开往家乡的列车也将会再次载着阿普的梦高山的鸟儿在唱着我的歌高山的雄鹰带着阿普的梦那一道道开往家乡的列车也将会再次载着阿普的梦还记得小时候过年我们把彝家美酒端起还记得我上个幼儿园你都要为我找关系还记的您总是不舍得孵的鸡蛋为我煎起一切的一切啊您是否还会在那山里 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~ 觉得还不错？可以在公众号菜单栏找到“赞赏”入口~","link":"/kewenlu/posts/44d31ecc/"},{"title":"贝叶斯：起步（1）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。本文为贝叶斯系列文章第 1 期，回顾一下贝叶斯定理。贝叶斯：起步（1） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 差点忘了我还是个科学类文章作者了，今天开始，启动新项目——贝叶斯。来体会这个流派在当今各类技术中的独到应用。 从这篇文章开始，我将系统性的介绍跟贝叶斯沾边的理论以及应用，发布在每周四的文章中，敬请追更。 要 24：00 了，我先把这个最核心的公式扔给各位，回味一下先~ 贝叶斯定理$$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 还记得它吗？ 下一期我们再正式开始，来细品这个神奇的公式。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/5ddfdbc9/"},{"title":"贝叶斯：起步（2）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。每周四更新，本文为贝叶斯系列文章第 2 期，回顾一下贝叶斯定理以及相关的术语。贝叶斯：起步（2） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 上周四来了一波儿回忆杀，让各位再次看到了这个贝叶斯定理的公式， $$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 为什么说这个公式神奇呢？用流行语讲就是，它支撑起了整个贝叶斯宇宙。什么朴素贝叶斯、贝叶斯优化、最大后验估计等等，这些在统计、机器学习领域司空见惯的术语，都和贝叶斯定理有着千丝万缕的联系。 今天，先回顾一下一些术语，再来看贝叶斯定理是什么意思。 术语（通俗版） 事件，即我们要研究的具备单一发生概率的、可多次发生但之间没有关联的对象，也就是所谓的独立同分布 i.i.d. 先验概率，事先就知道的事情，例如事件 A 发生的概率记作 $P(A)$ 条件概率，事先就知道的事情，例如固定条件 B 下事件 A 发生的概率记作 $P(A\\mid B)$ 联合概率，两个事件同时发生的概率，例如事件 A 和事件 B 同时发生的概率记作 $P(A\\bigcap B)$ 后验概率，一般事先不知道的事情，例如固定条件 A 下事件 B 发生的概率记作 $P(B\\mid A)$ 贝叶斯定理$$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 就是说 B 条件下事件 A 发生的后验概率等于 A 情况下事件 B 发生的条件概率乘以 A 条件发生的先验概率除以 B 条件发生的先验概率。 通常，右边这一坨是已知的。 好了，那么这个公式用大白话讲怎么说呢？ B 条件下发生 A 事件的概率乘以 B 条件发生的概率与 A 条件下发生 B 事件的概率乘以 A 条件发生的概率相等。 表面上看，这仿佛非常直观，但这确实是表面上。关键的困难在于，如何理解 A、B 反过来这件事。 下期细说~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/4f6a7427/"},{"title":"贝叶斯：起步（3）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。每周四更新，本文为贝叶斯系列文章第 3 期，用一个完整的例子感受下贝叶斯公式的力量。贝叶斯：起步（3） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 上周四，我们一起品味了这个贝叶斯公式，并且给出了一些术语的解释。 $$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 有细心的读者也指出了其中一些问题。这让我感觉有些读者还是不太清晰这些概念，那还是停一停。这里我画个表格，明确一下。 术语再理解假设有两个外边看不见内部的盒子（不多说了，你应该知道啥意思），盒 1 有 5 个球，3 黄 2 红；盒 2 有 7 个球，4 黄 3 红。 下面再看这些概念， 概念 符号 通俗理解 事件 A 某种特定的情况，比如“从盒 1 拿出一个球（这里是确定的），这个球是黄色的”(A) 先验概率 $P(A)$ 当下就知道的某个事件的发生概率，上面说的拿出黄球的概率 $P(A)=3/5$ 联合概率 $P(A\\bigcap B)$ A事件和B事件同时发生的概率；A和B之间是没有关联的；比如“同时从盒1、2中拿出黄球”的联合概率$P(A\\bigcap B)=P(A)\\times P(B)=12/35$ 重要理论 统计独立性 当且仅当两个随机事件A与B统计独立的，这样联合概率可以表示为各自概率的简单乘积 简单讲，就是 A 和 B 的发生没有关联 比如上面，分别从盒1、2中取球，两次取球就是独立的 好了，接下面是重头戏，一般是问题中比较烧脑的部分。 条件概率（后验概率）$P(A\\mid C_\\text{box1})$，$C_\\text{box1}$ 事件发生的情况下，A 事件发生的概率。 条件概率等价于后验概率，这个说的比较笼统，但我不觉得有什么不妥。条件概率是从形式上说的，后验概率是从陈述性表达上理解的。 先来个简单的，“随机（相当于蒙住了盒子号码）选择盒子，选择了盒子1，并从中拿出一个球，这个球是黄色”，可以表述为符号 $P(A\\mid C_\\text{box1})$， $A$ 事件，取出一个球（不管哪个盒子），这个球是黄色 $C_\\text{box1}$ 事件，随机选到盒子1 所以 $P(A\\mid C_\\text{box1})$ 就是说，我随机选择了盒子1（$C_\\text{box1}$），拿出的球是黄色($A$)的概率。因为两个事件独立，所以算这个概率很简单， $P(A\\mid C_\\text{box1})=P(A)\\times P(C_\\text{box1})=3/5\\times 1/2=3/10$ 就是说，随便选一个盒子，这个盒子是盒 1 且拿出来的球是黄球概率是 0.3。 贝叶斯的力量上面那种情况好算吧，但往往我们需要求解另一种更烧脑的情况——反过来。 比如，$P(C_\\text{box1}\\mid A)$，“取出了一个黄球（$A$），这个黄球来自盒1（$C_\\text{box1}$）”的概率。 这种需求很常见，但是怎么算呢？这就要利用贝叶斯公式。 代入贝叶斯公式， $$P(C_\\text{box1}\\mid A) = \\frac{P(A\\mid C_\\text{box1})\\times P(C_\\text{box1})}{P(A)}$$ 右边， $P(A\\mid C_\\text{box1})$ 上面算过了，$3/10$ $P(C_\\text{box1})$，$1/2$ $P(A)=P(A\\mid C_\\text{box1}) + P(A\\mid C_\\text{box2})$ $=3/5\\times 1/2 + 4/7\\times 1/2=41/70$ 体会到神奇之处了吗，对于这个烧脑的问题，居然可以通过贝叶斯“逆向”计算出来，结果是 $21/82$，就是说拿出黄球，黄球来自盒1 的概率是 $25.6%$ 左右！ 时间仓促，不知道写对没有，欢迎斧正！ 下期我们再列几个现实生活中的例子~ ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/f7d61342/"},{"title":"贝叶斯：起步（4&#x2F;4），三人成虎吗？（附代码）","text":"概率论（英语：Probability theory）是研究概率、随机性及不确定性等现象的数学分支，而贝叶斯学派(Bayesians)又是其中有代表性的流派。每周四更新，本文为贝叶斯系列文章第 4 期，再用一个生活中的例子感受下贝叶斯公式的力量。贝叶斯：起步（4/4），三人成虎，很有意思的例子（附代码） 文章来自微信公众号“科文路”，欢迎关注、互动。转载须注明出处。 上周四，我们通过一个例子认识了贝叶斯公式的力量， $$P(A\\mid B)={\\frac {P(A)P(B\\mid A)}{P(B)}}$$ 这个公式还有一个略显复杂的版本，长这样， $$P(A_i\\mid B)={\\frac {P(A_i)P(B\\mid A_i)}{\\sum_{j=1}^{\\infty}P(A_j)P(B\\mid A_j)}}$$ 这个公式可以这么理解：$A_j$ 是一系列事件，所有这些事件构成了完整的 $A$ 事件，$A_i$ 是其中一个我们想研究的特定事件。比如， 勘误上一篇文章中的 $P(A)=P(A\\mid C_\\text{box1}) + P(A\\mid C_\\text{box2})$ 虽然算的是对的，但实际上应该如上面的分母那样表示为 $P(A)=P(C_\\text{box1})P(A\\mid C_\\text{box1}) + P(C_\\text{box2})P(A\\mid C_\\text{box2})$ 实例一：三人成虎问题：你问三个人一件事的真实性，每个人给你的答复都有说谎的可能性。请问，如果三人都说某个事是真的，这个答案的实际真实性如何？ 列出贝叶斯公式， $$P(A_1\\mid B)={\\frac {P(A_1)P(B\\mid A_1)}{\\sum_{j=1}^{2}P(A_j)P(B\\mid A_j)}}$$ 关注贝叶斯公式右边， 某事件为真（$A_1$）的概率为 $P(A_1)=x$，这将会是一个先验概率； 某事件为假（$A_2$）的概率为 $P(A_2)=1-x$； 考虑三人成虎，三人都说一件事为真 $P(B)$ 的概率，只有两种情况， $P(A_1)P(B\\mid A_1)$，事件为真（$A_1$）时，三个朋友都说该事件为真（$B$）的概率为 $y^3x$; $P(A_2)P(B\\mid A_2)$，也就是说谎话，事件为假（$A_2$）时，三个朋友还说该事件为真（$B$）的概率为 $(1-y)^3(1-x)$ 代入公式， $$P(A_1\\mid B)=\\frac{y^3x}{y^3x+(1-y)^3(1-x)}$$ 实例例如，老家下雨的概率为 0.5，我问了 3 个人，他们都说现在老家确实正在下雨，而这 3 个人说谎的可能性是 0.3，请问确实在下雨的概率是多少？ 代入 $x=0.5, y=0.7$， $$P(确实下雨\\mid 三人说下雨)= \\frac{0.1715}{0.1715+0.0135}=0.927$$ 显然，这比我们事先得到的 0.5 的先验概率要高的多，所以这种情况下三人并不成虎！ 另一个角度：问的人越多，答案越真实吗进一步看上面这个公式，我们思考，如果生活中都是这样的人，我们求证一件事情的时候，是问的人越多越好吗？ 很简单，我们看这贝叶斯公式： $$P(A_1\\mid B)=\\frac{y^3x}{y^3x+(1-y)^3(1-x)}$$ 再抽象一下， 认为每个人的诚实度都一样，为$y$ 认为事情发生的先验概率，也就是历史总结出来的概率，为 $x$ 再确定“三人成虎”画出 x 和 y 的关系 f(x,y) = (x*y**3)/(x*y**3+(1-x)*(1-y)**3)-x，也就是看着两个因素对于事情可信度提升的影响， 可以从图中观察到一些重要的信息， 当 y&gt;0.5 时，即人们比较诚实时 x越小，z越大 也就是说，先验概率发生概率越小，通过问人得到肯定答复，可以得到更高的可信度 当 y&lt;0.5 时，即人们不诚实时 x越大，|z| 越大 也就是说，如果这些人平时就喜欢撒谎，那一件事发生的可能性越大，你从这些人口中得到肯定答复后，这件事的可信度反而更低 总的来说，选择诚实的人去问问题，得到正面答复后，这事的可信度会更高。 代码1234567891011121314151617181920212223242526272829303132333435363738# Import the necessary modulesimport numpy as npimport matplotlib.pyplot as pltfrom mpl_toolkits.mplot3d import Axes3D# Define the function to plotdef f(x, y): return (x*y**3)/(x*y**3+(1-x)*(1-y)**3)-x# Create a grid of x and y valuesx = np.linspace(0, 1, 50)y = np.linspace(0, 1, 50)x, y = np.meshgrid(x, y)# Compute the z valuesz = f(x, y)# Create a figure and an axes objectfig = plt.figure()ax = fig.add_subplot(111, projection='3d')# Plot the surfaceax.plot_surface(x, y, z, cmap='viridis')# Add labels and titleax.set_xlabel('x')ax.set_ylabel('y')ax.set_zlabel('z')ax.set_title('Surface plot of f(x,y) = (x*y**3)/(x*y**3+(1-x)*(1-y)**3)-x')# Add a plate as x=zx2 = x # Use z as the x values for the platey2 = y # Use y as the y values for the platez2 = np.zeros_like(x2) # Use zeros as the z values for the plateax.plot_surface(x2, y2, z2, color='red', alpha=0.5) # Plot the plate with red color and transparency# Show the plotplt.show() ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~ 至少点个赞再走吧~","link":"/kewenlu/posts/44a806d8/"},{"title":"速查：什么是全国两会？","text":"文章来自微信公众号“科文路”，欢迎关注、互动。转发须注明出处。速查：什么是全国两会？ 1 什么是“全国两会”？ 全国两会，即全国人大和全国政协每年春天在北京召开的两个重要会议——中华人民共和国全国人民代表大会和中国人民政治协商会议的统称。全国两会是中国的年度政治盛会，透过这个窗口，人们可以观察中国当下的热门关切，也可以看到“中国式民主”的特色。 2 什么是全国人民代表大会？ 人民代表大会制度是中国的根本政治制度。 全国人民代表大会由省、自治区、直辖市、特别行政区和人民解放军选出的代表组成。全国人民代表大会每届任期五年，每年举行一次会议。如果全国人民代表大会常务委员会认为必要，或者有五分之一以上的全国人民代表大会代表提议，可以临时召集全国人民代表大会会议。全国人民代表大会会议于每年第一季度举行，由全国人民代表大会常务委员会召集。 3 什么是中国人民政治协商会议？ 中国人民政治协商会议（简称人民政协）是由中国共产党、各民主党派、无党派民主人士、人民团体、各少数民族和各界代表、香港特别行政区人士、澳门特别行政区人士、台湾同胞和归国侨胞的代表以及特别邀请的人士组成。 按照政协章程的规定，政协全国委员会由党派、团体、方面及特邀四个方面、34个参加单位的2000多名委员组成。其中，党派有中国共产党和中国国民党革命委员会（民革）、中国民主同盟（民盟）、中国民主建国会（民建）、中国民主促进会（民进）、农工民主党、致公党、九三学社、台盟及无党派人士；团体有全国总工会、共青团、全国妇联、全国工商联、全国青联、中国科协、全国台联、全国侨联及对外友好团体和社会救济福利团体等；方面有文化艺术界、科技界、社科界、经济界、农林界、教育界、体育界、新闻出版界、医药卫生界、少数民族、香港同胞、澳门同胞和宗教界；特别邀请人士主要包括来自部委、军队、省市及其他一些有代表性的人物。 4 人大与政协是什么关系？ 全国人民代表大会是最高国家权力机关。 中国人民政治协商会议是中国人民爱国统一战线的组织和中国共产党领导的多党合作和政治协商的重要机构。 全国两会期间，人大代表是审议政府工作报告，政协委员是讨论政府工作报告，虽然只有一词之差，却显示了权力和职能的差别。宪法规定中国的国家行政机关、审判机关、检察机关都由人民代表大会产生，对它负责，受它监督。因此，全国两会上，国务院总理、最高人民法院院长和最高人民检察院检察长要向代表们报告工作。 ~~ 都看到这儿了，不如关注每日推送的“科文路”、互动起来~~ 至少，点个赞再走吧~","link":"/kewenlu/posts/a4ea21cc/"}],"tags":[{"name":"人文","slug":"人文","link":"/kewenlu/tags/%E4%BA%BA%E6%96%87/"},{"name":"时事","slug":"时事","link":"/kewenlu/tags/%E6%97%B6%E4%BA%8B/"},{"name":"科技","slug":"科技","link":"/kewenlu/tags/%E7%A7%91%E6%8A%80/"},{"name":"AI","slug":"AI","link":"/kewenlu/tags/AI/"},{"name":"图灵奖","slug":"图灵奖","link":"/kewenlu/tags/%E5%9B%BE%E7%81%B5%E5%A5%96/"},{"name":"GNN","slug":"GNN","link":"/kewenlu/tags/GNN/"},{"name":"数据可视化","slug":"数据可视化","link":"/kewenlu/tags/%E6%95%B0%E6%8D%AE%E5%8F%AF%E8%A7%86%E5%8C%96/"},{"name":"文物","slug":"文物","link":"/kewenlu/tags/%E6%96%87%E7%89%A9/"},{"name":"省馆之宝","slug":"省馆之宝","link":"/kewenlu/tags/%E7%9C%81%E9%A6%86%E4%B9%8B%E5%AE%9D/"},{"name":"开源","slug":"开源","link":"/kewenlu/tags/%E5%BC%80%E6%BA%90/"},{"name":"荐歌","slug":"荐歌","link":"/kewenlu/tags/%E8%8D%90%E6%AD%8C/"},{"name":"数学","slug":"数学","link":"/kewenlu/tags/%E6%95%B0%E5%AD%A6/"},{"name":"贝叶斯","slug":"贝叶斯","link":"/kewenlu/tags/%E8%B4%9D%E5%8F%B6%E6%96%AF/"}],"categories":[{"name":"人文","slug":"人文","link":"/kewenlu/categories/%E4%BA%BA%E6%96%87/"},{"name":"科技","slug":"科技","link":"/kewenlu/categories/%E7%A7%91%E6%8A%80/"}],"pages":[{"title":"404","text":"公益404页面 // xlindo","link":"/kewenlu/404.html"},{"title":"关于&quot;科文路&quot;","text":"Tech_LA（科文路） exists at the intersection of Technology and Liberal Arts. 这个站点是微信公众号“科文路”的一个存档，扫下方二维码可以关注该公众号。 站在科技与人文的交叉路口，这个公众号分享一些号主茁壮二次生长的历程。内容上，科学技术方面侧重于人工智能（机器学习、深度学习、强化学习），统计，集成电路，计算机体系结构，科技新闻等等；人文方面很难保证质量，能邀到大佬朋友的文章就着重发，没有就只有看我写的口水文了。 能力一般，水平有限，希望能对读者有所帮助。有问题或建议可以直接在公众号内回复。 微信公众号：科文路 头条号：科文路 抖音号：看球去了","link":"/kewenlu/about/index.html"}]}